Repository: the-turing-way/the-turing-way
Catalog: book/content/po/collaborating_github.*.po
Languages: es

source: ## README and project communication
es: ## README y la comunicación en proyectos

source: README files are the welcome mat for your project.
es: Los archivos README son la bienvenida a tu proyecto.

source: They are the first thing new visitors to your project will see and thus are part of a set of really important documents to make potential contributors feel welcome and invite them to get involved.
es: Son lo primero que verán los nuevos visitantes de tu proyecto y, por lo tanto, forman parte de un conjunto de documentos importantes para que los posibles colaboradores se sientan bienvenidos e invitarlos a participar.

source: Your [README file](https://mozilla.github.io/open-leadership-training-series/articles/opening-your-project/write-a-great-project-readme/) should cover:
es: Tu [archivo README] (https://mozilla.github.io/open-leadership-training-series/articles/opening-your-project/write-a-great-project-readme/) debe incluir:

source: * What you are doing, for who, and why.
es: * Qué estás haciendo, para quién y por qué.

source: * What makes your project special and exciting.
es: * Qué hace que tu proyecto sea especial y emocionante.

source: * How to get started.
es: * Cómo empezar.

source: * Where to find key resources.
es: * Dónde encontrar recursos clave.

source: An [Open Canvas](https://mozilla.github.io/open-leadership-training-series/articles/opening-your-project/develop-an-open-project-strategy-with-open-canvas/) can be a good tool to help you clarify what you want to achieve with your project and what you should cover in your README.
es: Un [Open Canvas (o lienzo en blanco en español)] (https://mozilla.github.io/open-leadership-training-series/articles/opening-your-project/develop-an-open-project-strategy-with-open-canvas/) puede ser una buena herramienta que te ayude a aclarar qué quieres lograr con tu proyecto y qué debes cubrir en tu README.

source: ## Roadmapping
es: ## Plan de trabajo

source: If you plan a larger piece of work, it is very useful to have an outline for the work you need to do and share it with potential contributors.
es: Si planeas un trabajo grande, es muy útil tener un esquema del trabajo que necesitas hacer y compartirlo con posibles colaboradores.

source: Your roadmap covers your goal and vision and should include a timeline for tasks that need to be completed, thus helping anyone new to your project to develop an understanding of what is currently happening on the project and what's coming next.
es: Tu plan de trabajo incluye tu objetivo y visión y debe incluir una línea de tiempo para las tareas que deben completarse, ayudando así a cualquier persona nueva en tu proyecto a desarrollar una comprensión de lo que está sucediendo actualmente en el proyecto y lo que viene a continuación.

source: A roadmap is also a great tool to highlight dependencies among tasks, helping you to schedule work on them efficiently.
es: Un plan de trabajo también es una gran herramienta para resaltar las dependencias entre las tareas, ayudándote a programar el trabajo en ellas de manera eficiente.

source: Milestones can be really helpful to get to your main goal.
es: Los hitos pueden ser realmente útiles para alcanzar tu objetivo principal.

source: Milestones can be organised around project goals, dates, events, or timeframes.
es: Los hitos se pueden organizar en torno a los objetivos, fechas, eventos o plazos del proyecto.

source: If you work on GitHub, you can use [GitHub's Project board](https://help.github.com/en/articles/tracking-the-progress-of-your-work-with-project-boards) to manage tasks and issues.
es: Si trabaja en GitHub, puede usar el [Tablero del proyecto de GitHub] (https://help.github.com/en/articles/tracking-the-progress-of-your-work-with-project-boards) para administrar tareas y problemas.

source: ## Getting contributors
es: ## Conseguir colaboradores

source: Your project is likely to be better if what you create is used by others and they feed back their ideas for additional features or improvements.
es: Es probable que tu proyecto sea mejor si lo que creas es utilizado por otros y estos envían sus ideas sobre funcionalidades adicionales o mejoras .

source: ### Personas and pathways
es: ###Personas y rutas

source: A persona is a description of a user of your project or tool.
es: En este contexto una "persona" es una descripción de un usuario de su proyecto o herramienta.

source: It should describe an imaginary person based on observations and knowledge of real life, and existing or potential users which provide enough detail for someone to imagine the persona's needs and reactions to the project.
es: Debe describir a una persona imaginaria basada en observaciones y conocimientos de la vida real, y usuarios existentes o potenciales que proporcionen suficientes detalles para que alguien pueda imaginar las necesidades y reacciones de la "persona" al proyecto.

source: Once you have created personas for your main users, you can imagine how they will interact with your project following these engagement phases:
es: Una vez que hayas creado "personas" para tus principales usuarios, puedes imaginar cómo interactuarán con tu proyecto después de estas fases de participación:

source: 1. Discovery: How they first hear about the project or group.
es: 1. Descubrimiento: cómo supieron del proyecto o grupo.

source: 2. First Contact: How they first engage with the project or group, their initial interaction.
es: 2. Primer contacto: cómo se involucran por primera vez con el proyecto o grupo, su interacción inicial.

source: 3. Participation: How they first participate or contribute.
es: 3. Participación: cómo participan o contribuyen por primera vez.

source: 4. Sustained Participation: How their contribution or involvement can continue.
es: 4. Participación sostenida: cómo puede continuar su contribución o participación.

source: 5. Networked Participation: How they may network within the community.
es: 5. Participación en red: cómo pueden trabajar en red dentro de la comunidad.

source: 6. Leadership: How they may take on some additional responsibility on the project, or begin to lead.
es: 6. Liderazgo: cómo pueden asumir alguna responsabilidad adicional en el proyecto o comenzar a liderar.

source: For an example persona and its pathway through an open project as well as further resources to help you create your own personas, see the [Mozilla Open leadership training](https://mozilla.github.io/open-leadership-training-series/articles/building-communities-of-contributors/bring-on-contributors-using-personas-and-pathways/).
es: Para ver un ejemplo de una "persona" y su camino a través de un proyecto abierto, así como otros recursos para ayudarte a crear tus propias personas, consulta la [Capacitación de liderazgo de Mozilla Open] (https://mozilla.github.io/open-leadership-training-series/articles/building-communities-of-contributors/bring-on-contributors-using-personas-and-pathways/).

source: ### Code of Conduct
es: ### Código de Conducta

source: If your project is open for individuals to contribute and you grow a community, this community will need to be welcoming and inclusive to thrive.
es: Si tu proyecto está abierto para que las personas contribuyan y haces crecer una comunidad, esta comunidad deberá ser acogedora e inclusiva para que prospere.

source: One way to establish guidelines for participating in your project is to create a Code of Conduct or Participating Guidelines.
es: Una forma de establecer pautas para participar en tu proyecto es crear un Código de conducta o Pautas de participación.

source: These documents can be used for virtual interactions but also for any events you might host related to your project.
es: Estos documentos se pueden utilizar para interacciones virtuales, pero también para cualquier evento que pueda albergar relacionado con tu proyecto.

source: Codes of Conducts serve two main purposes:
es: Los códigos de conducta tienen dos propósitos principales:

source: * Establishing the kind of behaviour encouraged in the community you would like to create as well as clearly outlining unacceptable behaviour.
es: * Establecer el tipo de comportamiento fomentado en la comunidad que les gustaría crear, así como también delinear claramente el comportamiento inaceptable.

source: * Outlining the process by which problems or violations of the guidelines will be addressed and who will be in charge of enforcing the Code of Conduct.
es: * Describir el proceso mediante el cual se abordarán los problemas o violaciones de las pautas y quién estará a cargo de hacer cumplir el Código de Conducta.

source: Many openly developed projects have a Code of Conduct in place that often is openly licensed and can be re-used and adapted for your own project.
es: Muchos proyectos desarrollados abiertamente cuentan con un Código de Conducta que a menudo tiene licencia abierta y se puede reutilizar y adaptar para tu propio proyecto.

source: The [Turing Way Code of Conduct](https://github.com/alan-turing-institute/the-turing-way/blob/master/CODE_OF_CONDUCT.md) is one example of a Code of Conduct built on various existing ones and can be adapted further.
es: El [Código de conducta de Turing Way] (https://github.com/alan-turing-institute/the-turing-way/blob/master/CODE_OF_CONDUCT.md) es un ejemplo de un Código de conducta basado en varios existentes y se puede adaptar más.

source: You can also consult the Mozilla Open Leadership Series [section on codes of conduct](https://mozilla.github.io/open-leadership-training-series/articles/building-communities-of-contributors/write-a-code-of-conduct/) for further guidelines and examples to get started on a code of conduct for your project.
es: También puedes consultar la Serie de liderazgo abierto de Mozilla [sección sobre códigos de conducta](https://mozilla.github.io/open-leadership-training-series/articles/building-communities-of-contributors/write-a-code -of-conduct/) para obtener más pautas y ejemplos para comenzar con un código de conducta para tu proyecto.

source: ### Contributor guidelines
es: ### Directrices para colaboradores

source: In addition to setting out some ground rules for the behaviour expected when collaborating on your project, you might want to provide some hands-on steps that potential collaborators should follow to add their contributions.
es: Además de establecer algunas reglas básicas para el comportamiento esperado al colaborar en tu proyecto, es posible que desees proporcionar algunos pasos prácticos que los posibles colaboradores deben seguir para agregar sus contribuciones.

source: Those instructions are laid out in a CONTRIBUTING file (this is an idea borrowed from software engineering where capitalized filenames are the norm for the most important files of a project).
es: Esas instrucciones se presentan en un archivo llamado "CONTRIBUTING" en inglés (esta es una idea tomada de la ingeniería de software donde los nombres de archivo en mayúsculas son la norma para los archivos más importantes de un proyecto).

source: Your audiences for the contributing guidelines are your potential contributors who need to understand what is expected from them, project consumers who need to know how they can remix and re-use your work, and yourself who creates and maintains the file as a key part to outline interactions with your community.
es: La audiencia para las pautas de contribuición son tus contribuyentes potenciales que necesitan comprender lo que se espera de ellos, los consumidores del proyecto que necesitan saber cómo pueden mezclar y reutilizar tu trabajo, y tú mismo, quien crea y mantiene el archivo como una parte clave para describa las interacciones con tu comunidad.

source: Similar to other key documents, is it recommended that you look at examples of contributing guidelines of similar projects and re-use those.
es: Al igual que en otros documentos clave, se recomienda que mires ejemplos de pautas de contribución de proyectos similares y los vuelvas a utilizar.

source: Here are a few suggestions of what your contributing guidelines could cover:
es: Aquí hay algunas sugerencias de lo que podrían cubrir tus pautas de contribución:

source: * Your project vision.
es: * Tu visión de proyecto.

source: * A welcome to potential contributors.
es: * Una bienvenida a los posibles contribuyentes.

source: * Pointers to the Code of Conduct.
es: * Notas apuntando hacia el Código de Conducta.

source: * A list of other important resources such as the README file or your project's roadmap.
es: * Una lista de otros recursos importantes como el archivo README o el plan de trabajo de tu proyecto.

source: * Communication channels where contributors can reach you.
es: * Canales de comunicación donde los colaboradores pueden contactarte.

source: * How to submit changes.
es: * Cómo hacer cambios.

source: * Good first bugs or issues to start working on.
es: * Primeros problemas or errores ("bugs") en los que empezar a trabajar.

source: * How to report a bug.
es: * Cómo reportar un error o "bug".

source: * Your recognition model and how contributions will get acknowledged.
es: * El modelo de reconocimiento y cómo se reconocerán las contribuciones.

source: * Where to go for help.
es: * Dónde buscar ayuda.

source: Have a look at the [Turing Way contributing guidelines](https://github.com/alan-turing-institute/the-turing-way/blob/master/CONTRIBUTING.md) to understand how you can contribute to this book and re-use some ideas for your own project.
es: Echa un vistazo a las [pautas de contribución de Turing Way] (https://github.com/alan-turing-institute/the-turing-way/blob/master/CONTRIBUTING.md) para comprender cómo puedes contribuir a este libro y reutiliza algunas ideas para tu propio proyecto.

source: ## GitHub contributor section as your checklist
es: ## Sección de colaboración en GitHub como lista de verificación

source: GitHub encourages collaboration practice in their community guidelines.
es: GitHub fomenta la práctica de colaboración en tus pautas comunitarias.

source: The insights tab of your GitHub project provides a section called "Community" that includes a list of recommended documents that your project should have.
es: La pestaña de "insights" (información) de tu proyecto de GitHub proporciona una sección llamada "Community" (o comunidad) que incluye una lista de documentos recomendados que tu proyecto debería tener.

source: Those include a README, Code of Conduct, Contributing guidelines, licence, and templates for issues and pull requests.
es: Entre ellos se incluyen un README, un código de conducta, pautas de contribución, una licencia y plantillas para "issues" y "pull requests".

source: ## Bibliography
es: ## Bibliografía

source: This chapter is an abbreviated version of the Mozilla Open Leadership Series material which is licensed under a [Creative Commons Attribution 4.0 licence](https://creativecommons.org/licenses/by/4.0/).
es: Este capítulo es una versión abreviada del material de la Serie Open Leadership de Mozilla que está bajo una [licencia Creative Commons Attribution 4.0] (https://creativecommons.org/licenses/by/4.0/).

source: The complete Open Leadership Handbook is available at https://mozilla.github.io/open-leadership-training-series/articles/readme/ and is highly recommended it as additional reading.
es: El "Open Leadership Handbook" (manual de liderazgo abierto) está disponible en https://mozilla.github.io/open-leadership-training-series/articles/readme/ y se recomienda encarecidamente como lectura adicional.

source: # Collaborating on GitHub/GitLab
es: # Colaborando en GitHub/GitLab

source: ## Prerequisites/recommended skill level
es: ## Requisitos previos / nivel de habilidad recomendado

source: | Prerequisite | Importance |
es: | Prerrequisito | Importancia |

source: | [Experience with version control](/version_control/version_control) | Helpful |
es: | [Experiencia con control de versiones](/version_control/version_control) | Útil |

source: ## Summary
es: ## Resumen

source: ## Why this is useful
es: ## Por qué esto es útil

source: Developing your project or analysis collaboratively on GitHub or GitLab provides a prompter to document your work in detail and it provides a great opportunity to get additional contributors to your idea.
es: El desarrollo de tu proyecto o análisis en colaboración en GitHub o GitLab proporcionan un indicador para documentar su trabajo en detalle y brinda una gran oportunidad para obtener colaboradores adicionales para tu idea.

source: Contributions can be everything from new ideas, to bug reports and actual code contributions.
es: Las contribuciones pueden ser de todo tipo, desde nuevas ideas hasta informes de errores y contribuciones de código.
