Repository: the-turing-way/the-turing-way
Catalog: book/content/po/continuous_integration.*.po
Languages: es

source: - Go to [Travis-ci.com](https://travis-ci.com) and [Sign up with GitHub](https://travis-ci.com/signin).
es: - Ve a [Travis-ci.com](https://travis-ci.com) y [inicia sesión con GitHub](https://travis-ci.com/signin).

source: - Accept the Authorization of Travis CI. You'll be redirected to GitHub.
es: - Acepta la autorización de Travis CI. El sistema te enlazará a GitHub.

source: - You will see a list of your GitHub repositories with buttons next to them. Click the button next to your project repository to activate Travis on it.
es: - Verás una lista de tus repositorios de GitHub con botones a los lados. Haz clic en el botón al lado de tu proyecto para activar Travis en este.

source: - Check the build status page to see if your build passes or fails, according to the return status of the build command by visiting the [Travis CI](https://travis-ci.com/auth) and selecting your repository.
es: - Comprueba la página de estado del build para ver si este pasa o falla, según el estado de retorno del comando de build, visitando la página [Travis CI](https://travis-ci.com/auth) y seleccionando tu repositorio.

source: - Next time you commit to your repository Travis will run on the updated version of your project and report the results.
es: - La próxima vez que hagas commit en tu repositorio, Travis se ejecutará en la versión actualizada de tu proyecto e informará de los resultados.

source: It's that simple. The rest of this section will describe the different components of the .travis.yml file and how to write them.
es: Es así de sencillo. El resto de esta sección describirá los diferentes componentes del archivo .travis.yml y cómo escribirlos.

source: ### Setting up the computational environment
es: ### Configuración del entorno computacional

source: This page on [common build problems](https://docs.travis-ci.com/user/common-build-problems/) is a good place to start troubleshooting if your build is broken.
es: Esta página sobre [problemas comunes de build](https://docs.travis-ci.com/user/common-build-problems/) es un buen lugar para empezar a solucionar problemas si tu build está fallando.

source: #### Operating system
es: #### Sistema operativo

source: Travis CI works with a few different operating systems. In the .travis.yml file define the operating system to run a project on via the os keyword like:
es: Travis CI funciona con varios sistemas operativos. En el archivo .travis.yml se define el sistema operativo para ejecutar un proyecto a través de la palabra clave «os» como:

source: or
es: o

source: It is possible to build and test a project on multiple operating systems and against multiple versions of a programming language. This will be not be discussed here as this presents and extra level of complexity and will not be needed in most cases for research, but it is discussed [later](#Testing_a_project_against_multiple_versions_of_a_programming_language).
es: Es posible hacer build y test de un proyecto en múltiples sistemas operativos y contra múltiples versiones de un lenguaje de programación. Esto no se discutirá aquí ya que presenta un nivel extra de complejidad y no será necesario en la mayoría de los casos para la investigación, pero se discute [más adelante](#Testing_a_project_against_multiple_versions_of_a_programming_language).

source: To specify the distribution of an operating system to run the project with use `dist`, for example:
es: Para especificar la distribución de un sistema operativo para correr el proyecto, usa 'dist', por ejemplo:

source: #### Programming language
es: #### Lenguaje de programación

source: Specify the programming language to run your project with using the language keyword, and specify which version of the language to use. So for python2.7 this would look like:
es: Especifica el lenguaje de programación con el que vas a ejecutar tu proyecto utilizando la palabra clave «language», y especifica qué versión del lenguaje vas a utilizar. Así que para python2.7 esto sería así:

source: Further information on the programming languages that are compatible with Travis can be found [here](https://docs.travis-ci.com/user/languages/)
es: Puedes encontrar más información sobre los lenguajes de programación compatibles con Travis [aquí](https://docs.travis-ci.com/user/languages/)

source: #### Compilers
es: #### Compiladores

source: If a compiled language is being used which compiler to run can be specified with the compiler keyword:
es: Si se utiliza un lenguaje compilado, se puede especificar el compilador que se va a ejecutar con la palabra clave «compiler»:

source: #### Dependencies
es: #### Dependencias

source: Not all languages/software are available on all operating systems however they can typically be installed within the .travis.yml file.
es: No todos los lenguajes ni software están disponibles en todos los sistemas operativos, sin embargo, normalmente se pueden instalar dentro del archivo .travis.yml.

source: To install packages that are not included in the standard version of the operating system specified you can include a `before_install` step in your `.travis.yml` along with the necessary code to install them, for example:
es: Para instalar paquetes que no están incluidos en la versión estándar del sistema operativo especificado puedes incluir un paso `before_install` en tu `.travis.yml` junto con el código necesario para instalarlos, por ejemplo:

source: #### Containers
es: #### Contenedores

source: It is possible to use Docker containers (see the reproducible computational environments chapter) to generate the computational environment by pulling and running the image from the .travis.yml file. If you are doing so you should pull or generate the image (preferably pull to save Travis from having to build the image from scratch) in the before_install step (see above section). Then in the .travis.yml file's script ([see next section](#The_travis_yml_script)) you can run a command to run your tests like:
es: Es posible utilizar contenedores Docker (ver el capítulo de entornos computacionales reproducibles) para generar el entorno computacional tirando y ejecutando la imagen desde el archivo .travis.yml. Si lo haces, debes extraer o generar la imagen (preferiblemente extraer para evitar que Travis tenga que construir la imagen desde cero) en el paso before_install (ver sección anterior). Luego en el script del archivo .travis.yml ([ver siguiente sección](#The_travis_yml_script)) puedes ejecutar un comando para ejecutar tus tests como:

source: So to use pytest to run tests in python files in a container built from an image called a_demo_image
es: Así que para usar pytest para ejecutar tests en archivos python en un contenedor hecho a partir de una imagen llamada a_demo_image

source: If you need to run more than one command in your script then you can include a script file within the container which contains those commands. Then the same process shown above can be used to run it, like:
es: Si necesitas ejecutar más de un comando en tu script entonces puedes incluir un archivo de script dentro del contenedor que contenga esos comandos. Así, se puede utilizar el mismo proceso mostrado anteriormente para ejecutarlo, como:

source: See [here](https://docs.travis-ci.com/user/docker/) for more information on this.
es: Mira [aquí](https://docs.travis-ci.com/user/docker/) para más información.

source: ### The .travis.yml script
es: ### El script .travis.yml

source: Travis will report that the build has failed if any commands in the script section return an error. Technically any commands can be included in the script, but it is mainly used for running tests. A script does not need to be long or complicated, as demonstrated by this example which uses the pytest command to run tests in python scripts:
es: Travis informará que el build ha fallado si cualquier comando en la sección de script devuelve un error. Técnicamente se puede incluir cualquier comando en el script, pero se utiliza principalmente para ejecutar los tests. Un script no necesita ser largo o complicado, como lo demuestra este ejemplo que utiliza el comando pytest para ejecutar tests en scripts de python:

source: If there are steps that need to be done before a project to be considered to be "fully" working these should also be included in the script too. Lets say some project needs a figure to be converted to a png file for some reason. The script could include
es: Si hay pasos que deben realizarse antes de que un proyecto se considere "completamente" funcional, estos también deben incluirse en el script. Digamos que algún proyecto necesita que una figura sea convertida a un archivo png por alguna razón. El script podría incluir

source: If for any reason this cannot be done an error will be returned and the build will be marked as having failed.
es: Si por alguna razón esto no se puede hacer, se devolverá un error y el build se marcará como fallido.

source: ### After success
es: ### After success (después del éxito)

source: The after success section is much like the script section in that it contains commands to run on the project. The key difference if that the build will not fail if steps in the after success section return errors.
es: La sección "after success" es muy parecida a la sección del script, ya que contiene comandos para ejecutar en el proyecto. La diferencia clave es que el build no fallará si los pasos en la sección "after success" devuelven errores.

source: The after success section is run after the script, and can be used to automate steps that need to be taken once a build has passed all the tests. Examples of things that can be automated include automatically merging the new version of the project to the master branch in GitHub. Another example is for the code coverage (see testing chapter) to be automatically measured and reported, as shown here:
es: La sección "after success" se ejecuta después del script, y se puede utilizar para automatizar los pasos que deben tomarse una vez que un build ha pasado todas las pruebas. Ejemplos de cosas que pueden ser automatizadas incluyen la fusión automática de la nueva versión del proyecto a la rama maestra (master branch) en GitHub. Otro ejemplo es que la cobertura del código (mira el capítulo de testing) se mida y se informe automáticamente, como se muestra aquí:

source: ### Testing a project against multiple versions of a programming language
es: ### Cómo probar un proyecto en múltiples versiones de un lenguaje de programación

source: When a project is expected to be run on systems with different versions of a programming language you can set Travis to run the tests on each of these versions. For example to test on a variety of versions of python:
es: Cuando se espera que un proyecto se ejecute en sistemas con diferentes versiones de un lenguaje de programación, se puede establecer que Travis ejecute las pruebas en cada una de estas versiones. Por ejemplo, para probar en una variedad de versiones de python:

source: ### Testing a project on multiple operating systems
es: ### Cómo hacer test de un proyecto en múltiples sistemas operativos

source: If your code is used on multiple operating systems it should be tested on multiple operating systems. To enable testing on multiple operating systems add multiple entries under the `os` key in your `.travis.yml` file, for example:
es: Si tu código se utiliza en varios sistemas operativos, debe ser probado en varios sistemas operativos. Para habilitar las pruebas (los tests) en varios sistemas operativos, añade varias entradas bajo la clave `os` en tu archivo `.travis.yml`, por ejemplo:

source: When you test your code on multiple operating systems, be aware of differences that can affect your tests, for example not all tools and programming languages are available on all operating systems. This should be taken into account when writing commands for your script file (or other sections of the .travis.yml file). Also file system behaviour may differ between OSs. Your tests may implicitly rely on these behaviours, and could fail because of them. They are different operating systems, after all.
es: Cuando hagas test en varios sistemas operativos, ten en cuenta las diferencias que pueden afectar a tus tests, por ejemplo, no todas las herramientas y lenguajes de programación están disponibles en todos los sistemas operativos. Esto debe tenerse en cuenta a la hora de escribir los comandos para tu archivo de script (u otras secciones del archivo .travis.yml). También el comportamiento del sistema de archivos puede diferir entre los sistemas operativos. Tus pruebas pueden depender implícitamente de estos comportamientos y podrían fallar debido a ellos. Después de todo, son sistemas operativos diferentes.

source: When Travis is running a job it sets the `TRAVIS_OS_NAME` variable which describes the operating system being tested. You can use this to run commands only on specified operating systems like this:
es: Cuando Travis está ejecutando un trabajo, asigna la variable `TRAVIS_OS_NAME` que describe el sistema operativo que se está probando. Puedes usar esto para ejecutar comandos sólo en sistemas operativos específicos como este:

source: ``` - if [[ "$TRAVIS_OS_NAME" == "osx" ]]; then command_to_run; fi ```
es: ``` - if [[ "$TRAVIS_OS_NAME" == "osx" ]]; then comando_a_ejecutar; fi ```

source: It is possible to go further and construct a [build matrix](https://docs.travis-ci.com/user/build-matrix/) to test a the project in a range of computational environments.
es: Es posible ir más allá y construir una [matriz de build](https://docs.travis-ci.com/user/build-matrix/) para hacer test del proyecto en una serie de entornos computacionales.

source: #### Allowing failures
es: #### Permitir fallos

source: To ignore the results of jobs in certain computational environments you can define rows that are allowed to fail in the build matrix. Do this by adding an `allow_failures` section to the .travis.yml file. Allowed failures are items in your build matrix that are allowed to fail without causing the entire build to fail. For example to allow the build to pass even if the job(s) using the osx operating system fail you'd add the following to your `.travis.yml`:
es: Para ignorar los resultados de los jobs en determinados entornos de cálculo, puedes definir las filas que pueden fallar en la matriz de build. Para ello, añade una sección `allow_failures` al archivo .travis.yml. Los fallos permitidos son elementos de la matriz de build que pueden fallar sin provocar el fallo de toda la compilación. Por ejemplo, para permitir que el build pase incluso si el (los) job(s) que utiliza el sistema operativo osx falla, añadirías lo siguiente a tu `.travis.yml`:

source: This is useful if you ideally want the build to be successful in multiple environments, but not all of them are vital.
es: Esto es útil si lo ideal es que build tenga éxito en varios entornos, pero no todos son vitales.

source: ## Limitations of CI
es: ## Limitaciones de la Integración Continua (CI por sus siglas en inglés)

source: CI does have its limitations. Firstly it is only as effective at finding bugs as the tests provided to it. If a project contains few or poor tests then it is entirely possible the project will contain bugs the tests do not catch and Travis will report the build as successful.
es: CI tiene sus limitaciones. En primer lugar, sólo es tan eficaz para encontrar errores como los tests que se le proporcionan. Si un proyecto contiene pocos o malos tests, es muy posible que el proyecto contenga errores que los tests no detecten y Travis informe de que el build se ha realizado correctamente.

source: Secondly, depending on the nature of your project there may be security considerations to think about.
es: En segundo lugar, dependiendo de la naturaleza de tu proyecto, puede haber consideraciones de seguridad que se deben tener en cuenta.

source: Travis CI obfuscates secure environment variables and tokens displayed in by the user interface. The [documentation about encryption keys](https://docs.travis-ci.com/user/encryption-keys/) outlines the build configuration required to set this up. However, if secret information is outputted in the course of running a script (for example in an error message) it may be included in Travis's build logs which may be accessible by others. To prevent leaks like this, secure environment variables and tokens that are longer than three characters are automatically filtered at runtime, effectively removing them from the build log, displaying the string `[secure]` instead. Nevertheless you should rotate your tokens and secrets regularly.
es: Travis CI ofusca las variables de entorno seguras y los tokens mostrados en la interfaz de usuario. La [documentación sobre claves de cifrado](https://docs.travis-ci.com/user/encryption-keys/) describe la configuración de build necesaria para establecer esto. Sin embargo, si la información secreta es emitida en el curso de la ejecución de un script (por ejemplo en un mensaje de error) puede ser incluida en los registros de construcción de Travis que pueden ser accesibles por otros. Para evitar este tipo de fugas, las variables de entorno seguras y los tokens de más de tres caracteres se filtran automáticamente en tiempo de ejecución, eliminándolos efectivamente del registro de construcción, mostrando la cadena `[secure]` en su lugar. Sin embargo, deberías cambiar tus tokens y secretos regularmente.

source: However there are still many ways in which secure information can accidentally be exposed. These vary according to what tools you are using and the settings enabled. Some things to look out for are:
es: Sin embargo, hay muchas formas en las que la información segura puede quedar expuesta accidentalmente. Éstas varían en función de las herramientas que se utilicen y de la configuración habilitada. Algunas cosas a las que hay que prestar atención son:

source: - Settings which duplicate commands to standard output, such as `set -x` or `set -v` in your bash scripts
es: - Configuraciones que duplican comandos a la salida estándar, como `set -x` o `set -v` en tus scripts de bash

source: - Displaying environment variables, by running `env` or `printenv`
es: - Cuándo imprimir las variables de entorno, ejecutando `env` o `printenv`.

source: - Printing secrets within the code, for example `echo "$SECRET_KEY"`
es: - La impresión de secretos dentro del código, por ejemplo `echo "$SECRET_KEY"`.

source: - Git commands like `git fetch` or `git push` may expose tokens or other secure environment variables
es: - Los comandos de Git como `git fetch` o `git push` pueden exponer tokens u otras variables de entorno seguras

source: - Settings which increase command verbosity
es: - Configuraciones que aumentan la verbosidad de los comandos

source: Preventing commands from displaying any output is one way to avoid accidentally displaying any secure information. If there is a particular command that is using secure information you can redirect its output to `/dev/null` to make sure it does not accidentally publish anything, as shown in the following example:
es: Impedir que los comandos muestren cualquier salida es una forma de evitar que se muestre accidentalmente cualquier información segura. Si hay un comando en particular que está usando información segura, puedes redirigir su salida a `/dev/null` para asegurarte de que no publique nada accidentalmente, como se muestra en el siguiente ejemplo:

source: If your project is set up such that each time a pull request is made on GitHub Travis tests that pull request there is an additional concern. If your tests require authentication credentials someone could make a pull request with malicious code to expose them. Therefore it is a good idea not to allow pull requests to automatically trigger Travis if you have such authentication requirements.
es: Si tu proyecto está configurado de tal manera que cada vez que se hace un pull request en GitHub Travis hace un test de ese pull request, hay una preocupación adicional. Si tus tests requieren credenciales de autenticación, alguien podría hacer un pull request con código malicioso para exponerlas. Por lo tanto, es una buena idea no permitir que los pull requests activen automáticamente a Travis si tienes tales requisitos de autenticación.

source: ## Best practise for continuous integration
es: ## Buenas prácticas para la integración continua

source: ### Small, iterative changes
es: ### Cambios pequeños e iterativos

source: One of the most important practices when adopting continuous integration is to encourage project members to make and commit small changes. Small changes minimize the possibility and impact of problems cropping up when they're integrated, which minimises the time and effort cost of integration.
es: Una de las prácticas más importantes a la hora de adoptar la integración continua es animar a los miembros del proyecto a realizar y confirmar pequeños cambios. Los cambios pequeños minimizan la posibilidad y el impacto de los problemas que surgen cuando se integran, lo que minimiza el coste de tiempo y esfuerzo de la integración.

source: ### Trunk-based development
es: ### Desarrollo basado en el "trunk" (rama principal)

source: With trunk-based development, work is done in the main branch of the repository or merged back into the shared repository at frequent intervals. Short-lived feature branches are permissible as long as they represent small changes and are merged back as soon as possible.
es: Con el desarrollo basado en el trunk (rama principal), el trabajo se realiza en la rama principal del repositorio o se fusiona con el repositorio compartido a intervalos frecuentes. Las ramas de características de corta duración están permitidas siempre que representen pequeños cambios y se fusionen de nuevo tan pronto como sea posible.

source: The idea behind trunk-based development is to avoid large commits that violate of concept of small, iterative changes discussed above. Code is available to peers early so that conflicts can be resolved when their scope is small.
es: La idea que subyace al desarrollo basado en el trunk es evitar commits grandes que incumplen el concepto de los cambios pequeños e iterativos que hemos comentado anteriormente. El código está disponible para los compañeros desde el principio para que los conflictos puedan resolverse cuando su alcance es pequeño.

source: ### Keep the building and testing phases fast
es: ### Mantén rápidas las fases de build y test

source: Because the build and test steps must be performed frequently, it is essential that these processes be streamlined to minimize the time spent on them. Increases in build time should be treated as a major problem because the impact is compounded by the fact that each commit kicks off a build.
es: Dado que los pasos de build y test deben realizarse con frecuencia, es esencial que estos procesos se agilicen para minimizar el tiempo empleado en ellos. Los aumentos en el tiempo de compilación deben tratarse como un problema importante porque el impacto se ve agravado por el hecho de que cada confirmación inicia un build.
