Repository: the-turing-way/the-turing-way
Catalog: book/content/po/continuous_integration.*.po
Languages: es

source: When possible, running different sections of the test suite in parallel can help move the build through the pipeline faster. Care should also be taken to make sure the proportion of each type of test makes sense. Unit tests are typically very fast and have minimal maintenance overhead. In contrast, automated system or acceptance testing is often complex and prone to breakage. To account for this, it is often a good idea to rely heavily on unit tests, conduct a fair number of integration tests, and then back off on the number of later, more complex testing.
es: Cuando sea posible, la ejecución de diferentes secciones del conjunto de tests en paralelo puede ayudar a que la compilación avance más rápidamente. También hay que asegurarse de que la proporción de cada tipo de prueba tiene sentido. Las pruebas unitarias (unit tests) suelen ser muy rápidas y tienen una sobrecarga de mantenimiento mínima. Por el contrario, las pruebas automatizadas del sistema o de aceptación suelen ser complejas y propensas a fallar. Para tener en cuenta esto, a menudo es una buena idea depender en gran medida de las pruebas unitarias, realizar un buen número de pruebas de integración, y luego reducir el número de pruebas posteriores, más complejas.

source: ### Computational expense
es: ### Gasto computacional

source: Some software will require significant compute resource to build and/or run. Examples include weather and climate models. This can make the use of continuous integration impractical as the tests either take too long or use too much resource. Therefore, a compromise needs to be found to balance the risk of incomplete testing against a usable development process.
es: Algunos programas requieren una cantidad importante de recursos de cómputo para su creación o ejecución. Algunos ejemplos son los modelos meteorológicos y climáticos. Esto puede hacer que el uso de la integración continua sea poco práctico, ya que los tests tardan demasiado o utilizan demasiados recursos. Por lo tanto, es necesario encontrar un compromiso para equilibrar el riesgo de pruebas incompletas con un proceso de desarrollo utilizable.

source: One approach is to use different levels of testing, with different subgroups being required depending on what is being changed. A common broad subgroup can be used in every case, with additional ones being invoked to test certain areas in more detail. This introduces an element of judgement to the testing process, but can be applied successfully.
es: Una posibilidad es utilizar diferentes niveles de tests, con diferentes subgrupos que se requieren en función de lo que se está cambiando. Se puede utilizar un subgrupo amplio común en todos los casos, y recurrir a otros adicionales para hacer tests en determinadas áreas con más detalle. Esto introduce un elemento de juicio en el proceso de pruebas, pero puede aplicarse con éxito.

source: ### Dependencies tracking
es: ### Seguimiento de dependencias

source: Checking for dependency updates should be done regularly. It can save a lot of time, avoiding bugs due to code dependent on deprecated functionality. Services such as [David](https://david-dm.org/) are available for dependency management.
es: La comprobación de las actualizaciones de las dependencias debe hacerse regularmente. Puedes ahorrar mucho tiempo, evitando errores debidos a código dependiente de funcionalidad obsoleta. Existen servicios como [David](https://david-dm.org/) para la gestión de dependencias.

source: ### Consistency throughout the pipeline
es: ### Consistencia en el pipeline

source: A project should be built once at the beginning of the pipeline, the resulting software should be stored and accessible to later processes without rebuilding. By using the exact same artefact in each phase, you can be certain that you are not introducing inconsistencies as a result of different build tools.
es: Al principio del pipeline debe correrse el build del proyecto, el software resultante debe ser almacenado y accesible a los procesos posteriores sin necesidad de reconstruirlo. Al utilizar exactamente el mismo artefacto en cada fase, puedes estar seguro de que no estás introduciendo inconsistencias como resultado de diferentes herramientas de build.

source: Also, the environment defined by the .travis.yml file should reflect the actual environment the code is run in. If that environment is modified don't forget to update the .travis.yml file, otherwise the results Travis returns will not be trustworthy.
es: Además, el entorno definido por el archivo .travis.yml debe reflejar el entorno real en el que se ejecuta el código. Si ese entorno se modifica no olvides actualizar el archivo .travis.yml, de lo contrario los resultados que devuelva Travis no serán fiables.

source: ## Checklist
es: ## Lista de verificación

source: - [ ] Have a project that you collaborate on with at least one other person
es: - [ ] Tener un proyecto en el que colaboras con al menos otra persona

source: - [ ] Put the project on GitHub
es: - [ ] Sube el proyecto a GitHub

source: - [ ] Have project members regularly commit their work to this central repository
es: - [ ] Hacer que los miembros del proyecto envíen regularmente (hagan commit de) su trabajo a este repositorio central

source: - [ ] That project should have at least some tests
es: - [ ] Ese proyecto debería tener al menos algunas pruebas

source: - [ ] Write a .travis.yml file which:
es: - [ ] Escribe un archivo .travis.yml que:

source: - [ ] Sets out the operating system the project is run on
es: - [ ] Establezca el sistema operativo en el que se ejecuta el proyecto

source: - [ ] Defines the programming language and version of that language to run the project with
es: - [ ] Defina el lenguaje de programación y la versión de ese lenguaje para ejecutar el proyecto

source: - [ ] Includes code to install any dependencies required to run the project in a before_install step
es: - [ ] Incluya código para instalar cualquier dependencia necesaria para ejecutar el proyecto en un paso before_install

source: - [ ] Contains a script to run the project tests
es: - [ ] Contenga un script para correr los tests del proyecto

source: - [ ] Commit the .travis.yml file to the project's GitHub repository
es: - [ ] Haz commit del archivo .travis.yml al repositorio GitHub del proyecto

source: - [ ] Go to [travis-ci.com](https://travis-ci.com/) and sign in with GitHub
es: - [ ] Ve a [travis-ci.com](https://travis-ci.com/) y accede a GitHub

source: - [ ] Activate Travis on your project repository
es: - [ ] Activa Travis en el repositorio de tu proyecto

source: - [ ] Each time a new commit is pushed Travis will run the tests and return the results. If these report that a commit causes test/tests to fail then find and fix the problem as soon as possible
es: - [ ] Cada vez que se envíe un nuevo commit, Travis ejecutará las pruebas y devolverá los resultados. Si estos informan de que un commit hace que los tests fallen, encuentra y soluciona el problema lo antes posible.

source: ## What to learn next
es: ## ¿Qué aprender a continuación?

source: If you have not already read the testing chapter it is suggested to do so to learn more about the different kinds of tests and their benefits in order to make the most of CI.
es: Si aún no has leído el capítulo sobre los tests, te sugerimos que lo hagas para conocer mejor los distintos tipos de pruebas y sus ventajas, con el fin de sacar el máximo partido a la IC.

source: ## Further reading
es: ## Lecturas complementarias

source: Travis offers a great deal of functionality not described here for automating other processes related to the testing and deployment of projects. Look into these, the Travis [documentation](https://docs.travis-ci.com/user/deployment) offers a good starting point for this.
es: Travis ofrece una gran cantidad de funcionalidades no descritas aquí para automatizar otros procesos relacionados con las pruebas y el despliegue (deployment) de proyectos. Para investigar, la [documentación](https://docs.travis-ci.com/user/deployment) de Travis ofrece un buen punto de partida.

source: A list of example Travis builds and tests for various languages/frameworks is available [here](https://github.com/softwaresaved/build_and_test_examples).
es: Una lista de ejemplos de build y tests de Travis para varios lenguajes y frameworks está disponible [aquí](https://github.com/softwaresaved/build_and_test_examples).

source: Travis's official tutorial is [here](https://docs.travis-ci.com/user/tutorial/). A tutorial focussed on using Travis with R can be found [here](https://juliasilge.com/blog/beginners-guide-to-travis/), tutorials geared towards python can be found [here](https://docs.python-guide.org/scenarios/ci/) and [here](https://docs.travis-ci.com/user/languages/python/).
es: El tutorial oficial de Travis está [aquí](https://docs.travis-ci.com/user/tutorial/). Un tutorial centrado en el uso de Travis con R se puede encontrar [aquí](https://juliasilge.com/blog/beginners-guide-to-travis/); los tutoriales orientados a python se pueden encontrar [aquí](https://docs.python-guide.org/scenarios/ci/) y [aquí](https://docs.travis-ci.com/user/languages/python/).

source: ## Definitions/glossary
es: ## Definiciones/glosario

source: **Build:** A group of jobs. For example, a build might have two jobs, each of which tests a project with a different version of a programming language. A build finishes when all of its jobs are finished.
es: **Build:** Un grupo de jobs (trabajos). Por ejemplo, un build puede tener dos jobs, cada uno de los cuales hace test de un proyecto con una versión diferente de un lenguaje de programación. Un build finaliza cuando todos sus jobs han terminado.

source: **Computational environment:** The environment where a project is run, including the operating system, the software installed on it, and the versions of both.
es: **Entorno informático:** El entorno donde se ejecuta un proyecto, incluyendo el sistema operativo, el software instalado en él y las versiones de ambos.

source: **Continuous integration:** The process of regularly combining the work of project members into a centralised version. Also called CI. CI software typically runs tests on the integrated version of a project to identify conflicts and bugs introduced by the integration.
es: **Integración continua:** El proceso de combinar regularmente el trabajo de los miembros del proyecto en una versión centralizada. También se denomina CI, por sus sigla en inglés. El software de CI suele ejecutar pruebas en la versión integrada de un proyecto para identificar los conflictos y los errores introducidos por la integración.

source: **GitHub:** A widely used version control platform.
es: **GitHub:** Una plataforma de control de versiones muy utilizada.

source: **Job:** An automated process that clones your repository into a virtual environment and then carries out a series of phases such as compiling your code and running tests. A job fails if the return code of the script encounters an error.
es: **Job (trabajo):** Un proceso automatizado que clona tu repositorio en un entorno virtual y luego lleva a cabo una serie de fases como la compilación de tu código y la ejecución de tests. Un job falla si el código de retorno del script encuentra un error.

source: **Travis:** A commonly used continuous integration platform.
es: **Travis:** Una plataforma de integración continua de uso común.

source: ## Bibliography
es: ## Bibliografía

source: ### Materials used: What is continuous integration?
es: ### Materiales utilizados: ¿Qué es la integración continua?

source: - [What is CI](https://github.com/travis-ci/docs-travis-ci-com/blob/master/user/for-beginners.md) **MIT**
es: - [Qué es CI](https://github.com/travis-ci/docs-travis-ci-com/blob/master/user/for-beginners.md) **MIT**

source: - [SSI blog](https://software.ac.uk/using-continuous-integration-build-and-test-your-software?_ga=2.231776223.1391442519.1547641475-1644026160.1541158284) **Creative Commons Attribution Non-Commercial 2.5 License**
es: - [Blog SSI](https://software.ac.uk/using-continuous-integration-build-and-test-your-software?_ga=2.231776223.1391442519.1547641475-1644026160.1541158284) **Licencia Creative Commons de Reconocimiento-NoComercial 2.5**

source: - [The difference between continuous integration, continuous deployment, and continuous delivery](https://www.digitalocean.com/community/tutorials/an-introduction-to-continuous-integration-delivery-and-deployment) **Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.**
es: - [La diferencia entre integración continua, despliegue (deployment) continuo y entrega continua](https://www.digitalocean.com/community/tutorials/an-introduction-to-continuous-integration-delivery-and-deployment) **Licencia internacional Creative Commons Reconocimiento-NoComercial-CompartirIgual 4.0.**

source: - [CI with python](https://docs.python-guide.org/scenarios/ci/) **Attribution-NonCommercial-ShareAlike 3.0 Unported**
es: - [IC con python](https://docs.python-guide.org/scenarios/ci/) **Reconocimiento-NoComercial-CompartirIgual 3.0 Unported**

source: ### Materials used: What is Travis and how does it work?
es: ### Materiales usados: ¿Qué es Travis y cómo funciona?

source: - [Info about how Travis works](https://github.com/travis-ci/docs-travis-ci-com/blob/master/user/for-beginners.md) **MIT**
es: - [Información sobre cómo funciona Travis](https://github.com/travis-ci/docs-travis-ci-com/blob/master/user/for-beginners.md) **MIT**

source: ### Materials used: Setting up continuous integration with Travis
es: ### Materiales usados: Configurando integración continua con Travis

source: - [Light travis tutorial](https://github.com/travis-ci/docs-travis-ci-com/blob/master/user/tutorial.md) **MIT**
es: - [Guía básica de Travis](https://github.com/travis-ci/docs-travis-ci-com/blob/master/user/tutorial.md) **MIT**

source: - [CI with travis](https://docs.python-guide.org/scenarios/ci/) **Attribution-NonCommercial-ShareAlike 3.0 Unported**
es: - [IC con Travis](https://docs.python-guide.org/scenarios/ci/) **Reconocimiento-NoComercial-CompartirIgual 3.0 Unported**

source: - [Installing dependencies via yaml](https://github.com/travis-ci/docs-travis-ci-com/edit/master/user/installing-dependencies.md) **MIT**
es: - [Instalar dependencias a través de yaml](https://github.com/travis-ci/docs-travis-ci-com/edit/master/user/installing-dependencies.md) **MIT**

source: - [Testing multiple versions of programming languages](https://docs.python-guide.org/scenarios/ci/) **Attribution-NonCommercial-ShareAlike 3.0 Unported (CC BY-NC-SA 3.0)**
es: - [Hacer tests de múltiples versiones de lenguajes de programación](https://docs.python-guide.org/scenarios/ci/) **Reconocimiento-NoComercial-CompartirIgual 3.0 Unported (CC BY-NC-SA 3.0)**

source: - [Using Travis with multiple operating systems](https://github.com/travis-ci/docs-travis-ci-com/blob/master/user/multi-os.md) **MIT**
es: - [Usar Travis con múltiples sistemas operativos](https://github.com/travis-ci/docs-travis-ci-com/blob/master/user/multi-os.md) **MIT**

source: - [Travis docs: customising the build](https://docs.travis-ci.com/user/customizing-the-build/) **MIT**
es: - [Documentación de Travis: ajustando el build](https://docs.travis-ci.com/user/customizing-the-build/) **MIT**

source: ### Materials used: Limitations of CI
es: ### Materiales utilizados: Limitaciones de la IC

source: - [Security with Travis](https://github.com/travis-ci/docs-travis-ci-com/blob/master/user/best-practices-security.md) **MIT**
es: - [Seguridad con Travis](https://github.com/travis-ci/docs-travis-ci-com/blob/master/user/best-practices-security.md) **MIT**

source: ### Materials used: Best practise for continuous integration
es: ### Materiales usados: buenas prácticas para la integración continua

source: - [Continuous integration, continuous deployment and continuous delivery](https://www.digitalocean.com/community/tutorials/an-introduction-to-continuous-integration-delivery-and-deployment) **Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.**
es: - [Integración continua, deployment continuo y entrega continua](https://www.digitalocean.com/community/tutorials/an-introduction-to-continuous-integration-delivery-and-deployment) **Licencia Internacional Creative Commons Reconocimiento-NoComercial-CompartirIgual 4.0.**

source: - [Netherlands eScience Center guide](https://guide.esciencecenter.nl/best_practices/testing.html) **Creative Commons Attribution 4.0 International**
es: - [Guía del Centro Neerlandés eScience](https://guide.esciencecenter.nl/best_practices/testing.html) **Licencia Internacional Creative Commons de Reconocimiento 4.0.**

source: ## Acknowledgements
es: ## Agradecimientos

source: Thanks to David Jones of the University of Sheffield RSE group for useful discussions.
es: Gracias a David Jones, del grupo de RSE de la Universidad de Sheffield, por sus útiles comentarios y debates sobre el tema.
