Repository: the-turing-way/the-turing-way
Catalog: book/content/po/continuous_integration.*.po
Languages: es

source: # Continuous integration
es: # Integración continua

source: | Prerequisite | Importance | Notes |
es: | Pre-requisitos | Importancia | Notas |

source: | [Experience with the command line](https://programminghistorian.org/en/lessons/intro-to-bash) | Necessary | Continuous integration will follow command line instructions
es: | [Experiencia con la línea de comandos](https://programminghistorian.org/en/lessons/intro-to-bash) | Necesario | La integración continua seguirá las instrucciones de línea de comandos

source: | [Version control](/version_control/version_control) | Necessary | Continuous integration runs every time a new _commit_ is made to your project |
es: | [Control de versiones](/version_control/version_control) | Necesario | La integración continua corre cada vez que un _commit_ nuevo es hecho en tu proyecto.|

source: | [Reproducible computational environments](/reproducible_environments/reproducible_environments) | Necessary | Continuous integration runs your tests on a separate computer (usually in the cloud) so you need to set it up in the same way. |
es: | [Entornos computacionales reproducibles](/reproducible_environments/reproducible_environments) | Necesario | La integración continua ejecuta sus pruebas en un computador separado (normalmente en la nube) por lo que necesitas configurarlo de la misma manera. |

source: | [Testing](/testing/testing) | Very helpful | Continuous integration _tests_ if anything important has changed when you make a change in your project |
es: | [Testing](/testing/testing) | Muy útil | Integración continua _prueba_ si algo importante ha cambiado cuando haces un cambio en tu proyecto. |

source: ## Table of contents
es: ## Tabla de contenidos

source: - [Summary](#Summary)
es: - [Resumen](#Summary)

source: - [How this will help you/ why this is useful](#Why_this_is_useful)
es: - [Cómo te ayudará esto/ por qué es útil](#Why_this_is_useful)

source: - [What are continuous delivery and continuous deployment?](#What_are_continuous_delivery_and_continuous_deployment)
es: - [¿Qué son la entrega continua y el (paso a producción) «deployment» continuo?](#What_are_continuous_delivery_and_continuous_deployment)

source: - [What is Travis and how does it work?](#What_is_Travis_and_how_does_it_work)
es: - [¿Qué es Travis y cómo funciona?](#What_is_Travis_and_how_does_it_work)

source: - [Setting up continuous integration with Travis](#Setting_up_continuous_integration_with_Travis)
es: - [Cómo establecer la integración continua con Travis](#Setting_up_continuous_integration_with_Travis)

source: - [Basic steps](#Basic_steps)
es: - [Pasos básicos](#Basic_steps)

source: - [Setting up the computational environment](#Setting_up_the_computational_environment)
es: - [Cómo establecer el entorno computacional](#Setting_up_the_computational_environment)

source: - [Operating system](#Operating_system)
es: - [Sistema operativo](#Operating_system)

source: - [Programming language](#Programming_language)
es: - [Lenguaje de programación](#Programming_language)

source: - [Compilers](#Compilers)
es: - [Compiladores](#Compilers)

source: - [Dependencies](#Dependencies)
es: - [Dependencias](#Dependencies)

source: - [Containers](#Containers)
es: - [Contenedores](#Containers)

source: - [The .travis.yml script](#The_travis_yml_script)
es: - [El script .travis.yml](#The_travis_yml_script)

source: - [After success](#After_success)
es: - [Al finalizar con éxito la integración continua](#After_success)

source: - [Testing a project against multiple versions of a programming language](#Testing_a_project_against_multiple_versions_of_a_programming_language)
es: - [Cómo hacer test de un proyecto contra múltiples versiones de un lenguaje de programación](#Testing_a_project_against_multiple_versions_of_a_programming_language)

source: - [Testing a project on multiple operating systems](#Testing_a_project_on_multiple_operating_systems)
es: - [Cómo hacer test de un proyecto en múltiples sistemas operativos](#Testing_a_project_on_multiple_operating_systems)

source: - [Allowing failures](#Allowing_failures)
es: - [Permitiendo que la integración continua falle](#Allowing_failures)

source: - [Limitations of CI](#Limitations_of_CI)
es: - [Limitations de la Integración continua](#Limitations_of_CI)

source: - [Best practise for continuous integration](#Best_practise_for_continuous_integration)
es: - [Mejores prácticas para la integración continua](#Best_practise_for_continuous_integration)

source: - [Small, iterative changes](#Small_iterative_changes)
es: - [Cambios pequeños e iterativos](#Small_iterative_changes)

source: - [Trunk-based development](#Trunk_based_development)
es: - [Desarrollo basado en el «trunk» (rama principal)](#Trunk_based_development)

source: - [Keep the building and testing phases fast](#Keep_the_building_and_testing_phases_fast)
es: - [Mantén rápidas las fases de construcción y prueba](#Keep_the_building_and_testing_phases_fast)

source: - [Computational expense](#Computational_expense)
es: - [Gasto computacional](#Computational_expense)

source: - [Dependencies tracking](#Dependencies_tracking)
es: - [«Tracking» (rastreo) de las dependencias](#Dependencies_tracking)

source: - [Consistency throughout the pipeline](#Consistency_throughout_the_pipeline)
es: - [Consistencia en el «pipeline» (cadena de procesos)](#Consistency_throughout_the_pipeline)

source: - [Checklist](#Checklist)
es: - [Lista de control](#Checklist)

source: - [What to learn next](#What_to_learn_next)
es: - [Qué aprender a continuación](#What_to_learnt_next)

source: - [Further reading](#Further_reading)
es: - [Lectura adicional](#Further_reading)

source: - [Definitions/glossary](#Definitions_glossary)
es: - [Definiciones/glosario](#Definitions_glossary)

source: - [Bibliography](#Bibliography)
es: - [Bibliografía](#Bibliography)

source: ## Summary
es: ## Resumen

source: Continuous integration (CI) is the practice of integrating changes to a project made by individuals into a main, shared version frequently (usually multiple times per day). CI software is also typically used to identify any conflicts and bugs that are introduced by changes, so they are found and fixed early, minimizing the effort required to do so. Running tests regularly also saves humans from needing to do it manually. By making users aware of bugs as early as possible researchers (if the project is a research project) do not waste a lot of time doing work that may need to be thrown away, which may be the case if tests are run infrequently and results are produced using faulty code.
es: La integración continua (IC) es la práctica de integrar los cambios realizados por las personas en un proyecto en una versión principal y compartida con frecuencia (por lo general varias veces al día). El software de IC también se suele utilizar para identificar los conflictos y «bugs» (errores) que introducen los cambios, de manera que se encuentren y se solucionen pronto, reduciendo al mínimo el esfuerzo necesario para ello. La realización de pruebas con regularidad también evita que los seres humanos tengan que hacerlo manualmente. Al dar a conocer los errores a los usuarios lo antes posible, los investigadores (si se trata de un proyecto de investigación) no pierden mucho tiempo haciendo trabajos que tal vez haya que desechar, lo que puede ocurrir si las pruebas se ejecutan con poca frecuencia y los resultados se producen utilizando un código defectuoso.

source: ## How this will help you/ why this is useful
es: ## Cómo te ayudará esto/ por qué esto es útil

source: CI has a number of key benefits:
es: La IC tiene un número de beneficios clave:

source: - Helps bugs to be found early, minimizing their damage and making them easier to fix
es: - Ayuda a encontrar de manera temprana los bugs, minimizando su daño y haciéndolos más fáciles de arreglar.

source: - Keeps project contributors up to date with each other's work so they can benefit from it as soon as possible
es: - Mantiene a los colaboradores al tanto del trabajo de los demás para que puedan beneficiarse de este lo antes posible.

source: - Encourages users to write tests
es: - Anima a los usuarios a escribir pruebas

source: - Automates running of tests
es: - Automatiza la ejecución de las pruebas.

source: - Ensures tests are run frequently
es: - Asegura que las pruebas sean hechas frecuentemente.

source: ## What is continuous integration?
es: ## ¿Qué es la integración continua?

source: This chapter demands a strong understanding of version control. The central concepts you will need to recall are:
es: Este capítulo requiere un entendimiento sólido de control de versiones. Los conceptos centrales que necesitas recordar son:

source: - How it can be used to enable people collaborating on a single project to combine their work via merging
es: - Cómo puede utilizarse para que las personas que colaboran en un mismo proyecto combinen su trabajo mediante la fusión («merge»)

source: - What merge conflicts are and the difficulties they can present
es: - Qué son los conflictos de fusión («merge») y las dificultades que pueden presentar

source: - What GitHub is and how to use it
es: - Qué es GitHub y cómo utilizarlo

source: In brief if a group of researchers are collaborating on a project it is good practise for them to use version control to keep track of their changes over time, and combine their work regularly. If they do not combine (integrate) their work regularly then when they come to do so it is likely to be very difficult as different people may have made contradictory changes.
es: En resumen, si un grupo de investigadores colabora en un proyecto, es una buena práctica que utilicen el control de versiones para hacer un seguimiento de sus cambios a lo largo del tiempo y combinar su trabajo con regularidad. Si no combinan (integran) su trabajo con regularidad, es probable que cuando tengan que hacerlo les resulte muy difícil, ya que diferentes personas pueden haber hecho cambios contradictorios.

source: Continuous Integration is a software development practice where members of a team integrate their work frequently, rather than doing work in isolation and merging in large changes at infrequent intervals. In CI usually each person integrates at least daily. Each integration is verified by an automated build (usually including tests) to detect integration errors as quickly as possible.
es: La integración continua es una práctica de desarrollo de software en la que los miembros de un equipo integran su trabajo con frecuencia, en lugar de hacer el trabajo de forma aislada y fusionar los grandes cambios a intervalos poco frecuentes. En la integración continua, cada persona suele integrar al menos una vez al día. Cada integración se verifica mediante una compilación automatizada (que suele incluir pruebas) para detectar los errores de integración lo antes posible.

source: The idea is to minimize the cost of integration by making it an early consideration. Researchers can discover conflicts at the boundaries between new and existing code early, while they are still relatively easy to reconcile. Once the conflict is resolved, work can continue with confidence that the new code honours the requirements of the existing codebase. The goal is to build healthier software by developing and testing in smaller increments. Many teams find that this approach leads to significantly reduced integration problems and allows a team to develop more rapidly.
es: La idea es minimizar el costo de la integración haciendo que sea una consideración temprana. Los investigadores pueden descubrir pronto los conflictos en los límites entre el código nuevo y el existente, cuando todavía son relativamente fáciles de conciliar. Una vez resuelto el conflicto, el trabajo puede continuar con la confianza de que el nuevo código cumple los requisitos de la base de código existente. El objetivo es construir un software más saludable desarrollando y probando en incrementos más pequeños. Muchos equipos descubren que este enfoque reduce considerablemente los problemas de integración y permite al equipo desarrollar más rápidamente.

source: Integrating code frequently does not, by itself, offer any guarantees about the quality of the new code or functionality. This leads us to the second aspect of CI. When a developer merges code into the main repository, automated processes build a working version of the project. Afterwards, test suites are run against the new build to check whether any bugs were introduced. If either the build or the test phase fails, the team is alerted so that they can work to fix the problem. It is easier to fix a bug in something you wrote a few minutes ago than something you wrote yesterday (or last week, or last month).
es: Integrar el código con frecuencia no ofrece, por sí mismo, ninguna garantía sobre la calidad del nuevo código o funcionalidad. Esto nos lleva al segundo aspecto de la IC. Cuando un desarrollador fusiona el código en el repositorio principal, los procesos automatizados construyen una versión de trabajo del proyecto. Después, se ejecutan conjuntos de pruebas con la nueva versión para comprobar si se ha introducido algún error. Si la fase de construcción o de prueba falla, se avisa al equipo para que pueda trabajar para solucionar el problema. Es más fácil corregir un error en algo que has escrito hace unos minutos que en algo que escribiste ayer (o la semana pasada, o el mes pasado).

source: By ensuring that your code is built and tested regularly CI helps researchers to demonstrate that their code does what it claims to do, and that it does so correctly. Typically, continuous integration servers will also allow build-and-test jobs to run at specific times, so a CRON-like, nightly-build-and-test, can be done, as well as a build-and-test job run on-demand.
es: Al asegurar que tu código se construye y se prueba regularmente, la integración continua ayuda a los investigadores a demostrar que su código hace lo que dice hacer, y que lo hace correctamente. Normalmente, los servidores de integración continua también permiten que las tareas de construcción y prueba («build» y «test») se ejecuten en momentos específicos, por lo que se puede realizar una tarea de build y test nocturna del estilo de CRON, así como una tarea de build y test ejecutada cuando se desee.

source: ### What are continuous delivery and continuous deployment?
es: ### ¿Qué son la entrega continua y el "deployment" (despliegue) continuo?

source: Technically speaking the above explanation conflates three related concepts, continuous integration, continuous deployment, and continuous delivery. In reality:
es: Técnicamente, la explicación anterior combina tres conceptos relacionados: integración continua, despliegue continuo y entrega continua. En realidad:

source: - Continuous integration focuses on regularly integrating work from individual researchers into a main repository.
es: - La integración continua se enfoca en integrar regularmente el trabajo de investigadores individuales en un repositorio principal.

source: - Continuous delivery automates and runs the steps required to build and test the project.
es: - La entrega continua automatiza y ejecuta los pasos requeridos para el build y el test del proyecto.

source: - Continuous deployment takes this one step further by automatically deploying each time a code change is made.
es: - El despliegue continuo lleva esto más allá al desplegar automáticamente cada vez que el código se cambia.

source: In this chapter this entire process is referred to as continuous integration for the sake of simplicity.
es: En este capítulo, todo este proceso se denomina integración continua, por simplicidad.

source: ## What is Travis and how does it work?
es: ## ¿Qué es Travis y cómo funciona?

source: There are a number of CI tools available, such Circle (tutorials [here](https://circleci.com/docs/2.0/project-walkthrough/) and [here](https://circleci.com/docs/2.0/hello-world/)). A list of other CI tools can be found [here](https://www.software.ac.uk/resources/guides/hosted-continuous-integration). In this chapter we will focus on [Travis](https://travis-ci.org/) because it's free (if your code is openly available), widely used, and well integrated with the version control platform [GitHub](https://github.com/).
es: Hay una serie de herramientas de IC disponibles, como Circle (tutoriales [aquí](https://circleci.com/docs/2.0/project-walkthrough/) y [aquí](https://circleci.com/docs/2.0/hello-world/)). Se puede encontrar una lista de otras herramientas de CI [aquí](https://www.software.ac.uk/resources/guides/hosted-continuous-integration). En este capítulo nos centraremos en [Travis](https://travis-ci.org/) porque es gratuita (si tu código está disponible abiertamente), ampliamente utilizada, y bien integrada con la plataforma de control de versiones [GitHub](https://github.com/).

source: To use Travis you will need to add a file to your project called `.travis.yml` which describes the computational environment to run the project in, and includes a script to run your tests. See the chapter on reproducible computational environments for more information on them, including writing `.yml` files to specify them. See the chapter on testing for information on writing and automating tests. The .travis.yml file has a number of other capabilities, which will be described [later](#After_success) along with more [detailed instructions](#Setting_up_the_computational_environment) for writing these files.
es: Para usar Travis necesitarás añadir un archivo a tu proyecto llamado `.travis.yml` que describa el entorno computacional en el que ejecutar el proyecto, e incluya un script para ejecutar tus pruebas. Consulta el capítulo sobre entornos computacionales reproducibles para obtener más información sobre ellos, incluyendo la escritura de archivos `.yml` para especificarlos. Mira el capítulo sobre las pruebas para obtener información sobre cómo escribir y automatizar las pruebas. El archivo `.travis.yml` tiene una serie de otras capacidades, que se describirán [más adelante](#Después_del_exito) junto con más [instrucciones detalladas](#Configuración_del_entorno_computacional) para escribir estos archivos.

source: Once Travis has been set up on a project then each time a commit is made it:
es: Una vez que Travis ha sido configurado en un proyecto, cada vez que se hace un commit, sucede lo siguiente:

source: - Clones a copy of project
es: - Clona una copia del proyecto

source: - Generates a copy of the computational environment specified in the .travis.yml file in a brand new virtual environment
es: - Genera una copia del ambiente computacional especificado en el archivo .travis.yml en el nuevo entorno virtual

source: - Builds the project within that environment
es: - Corre el build del proyecto dentro de este entorno.

source: - Runs the tests by following the script specified in the .travis.yml file
es: - Ejecuta las pruebas siguiendo el script especificado en el archivo .travis.yml

source: - Reports the results
es: - Reporta los resultados

source: - Travis will output the results of every step of building the environment and running the script as a log viewable in your account on the [Travis site](https://travis-ci.org/) (the dark grey box in the figure below).
es: - Travis mostrará los resultados de cada paso de la construcción del entorno y la ejecución del script como un registro visible en su cuenta en el [sitio web de Travis](https://travis-ci.org/) (el cuadro gris oscuro en la figura de abajo).

source: - Travis will attach a badge to the results, green if all steps in the script (which run the tests) pass, red if not. The badge will be yellow whilst Travis is still running. If Travis is unable to generate the computational environment described in the .travis.yml file then it will not proceed further and the badge will be grey. See the figures below which show the passing build badge and failing build badge in the readme of a GitHub repository.
es: - Travis adjuntará una etiqueta a los resultados, de color verde si todos los pasos del script (que ejecutan las pruebas) pasan, de color rojo si no. La etiqueta será amarilla mientras Travis esté ejecutándose. Si Travis no puede generar el entorno computacional descrito en el archivo .travis.yml, no seguirá adelante y la etiqueta será gris. Vea las siguientes figuras que muestran la etiqueta de build exitoso y la etiqueta de build con falla en el readme de un repositorio de GitHub.

source: - Travis will also report the results via email (notification settings can be adjusted).
es: - Travis también informará de los resultados por correo electrónico (se puede ajustar la configuración de esta notificación).

source: Here's what the Travis dashboard of a repository looks like:
es: Así es como se ve el panel de control de Travis de un repositorio:

source: Everything's green because the build is passing. Note the "build passing" badge at the top. If you click that you will get a popup with a dropdown menu where you can select a way of copying the badge. If you select "markdown" and copy and paste the code snippet it outputs into a markdown file in the project, then GitHub will display the badge in that file:
es: Todo está en verde porque el build fue exitoso. Fíjate en la insignia "build passing" de la parte superior. Si haces clic en ella, aparecerá una ventana emergente con un menú desplegable en el que puedes seleccionar una forma de copiar la etiqueta. Si seleccionas "markdown" y copias y pegas el fragmento de código que produce en un archivo markdown en el proyecto, entonces GitHub mostrará la etiqueta en ese archivo:

source: If I deliberately create a bug and commit it then Travis automatically runs, the tests fail, and this badge automatically updates to "build failing":
es: Si creo deliberadamente un error y lo confirmo, Travis se ejecuta automáticamente, las pruebas fallan, y esta etiqueta se actualiza automáticamente a "build failing":

source: You can use Travis to test your project in multiple computational environments my specifying them in the .travis.yml file. A quick note on Travis vocabulary:
es: Puedes utilizar Travis para probar tu proyecto en múltiples entornos computacionales, especificándolos en el archivo .travis.yml. Una nota rápida sobre el vocabulario de Travis:

source: - Job - an automated process that clones your repository into a virtual environment and then carries out a series of phases such as compiling your code and running tests. A job fails if the return code of the script encounters an error.
es: - Job - es un proceso automatizado que clona tu repositorio en un entorno virtual y luego lleva a cabo una serie de fases como la compilación de código y la ejecución de pruebas. Un trabajo falla si el código de retorno del script encuentra un error.

source: - Build - a group of jobs. For example, a build might have two *jobs*, each of which tests a project with a different version of a programming language. A build finishes when all of its jobs are finished.
es: - Build - un grupo de "jobs" (trabajos). Por ejemplo, una compilación puede tener dos *jobs*, cada uno de los cuales prueba un proyecto con una versión diferente de un lenguaje de programación. Un build finaliza cuando todos sus jobs han terminado.

source: ## Setting up continuous integration with Travis
es: ## Configuración de la integración continua con Travis

source: ### Basic steps
es: ## Pasos básicos

source: - Write a `.travis.yml` file and add it to your project.
es: - Escribe un archivo '.travis.yml' y agrégalo a tu proyecto.

source: - Upload your project to GitHub if you have not already.
es: - Sube tu proyecto a GitHub si aún no lo has hecho.
