Repository: the-turing-way/the-turing-way
Catalog: book/content/po/credit.*.po
Languages: es

source: # Credit for reproducible research
es: # Crédito para la investigación reproducible

source: Future work:
es: Trabajo futuro:

source: - Demonstrating impact with various metrics
es: - Demostrando impacto con distintas métricas

source: ## Prerequisites / recommended skill level
es: ## Pre-requisitos / nivel de conocimiento recomendado

source: | Prerequisite | Importance | Notes |
es: | Pre-requisitos | Importancia | Notas |

source: | [Reproducibility][] | Useful but not essential | |
es: | [Reproducibilidad] [] | Útil pero no esencia l | |

source: | [Open research][] | Useful but not essential | |
es: | [Investigación abierta] [] | Útil pero no esencial | |

source: [Reproducibility]: /reproducibility/reproducibility.html
es: [Reproducibilidad]: /reproducibility/reproducibility.html

source: [Open research]: /open_research/open_research.html
es: [Investigación abierta]: /open_research/open_research.html

source: 1. [Summary](#summary)
es: 1. [Resumen] (#resumen)

source: 2. [How this will help you/why this is useful?](#how-this-will-help-you-why-this-is-useful)
es: 2. [¿Cómo te ayudará esto/por qué es útil?](#how-this-will-help-you-why-this-is-useful)

source: 3. [Making it easy to cite your stuff](#making-it-easy-to-cite-your-stuff)
es: 3. [Facilitando la citabilidad de tu trabajo](#making-it-easy-to-cite-your-stuff)

source: 5. [What to learn next](#what-to-learn-next)
es: 5. [¿Qué aprender después?](#what-to-learn-next)

source: 6. [Further reading](#further-reading)
es: 6. [Lectura adicional](#lectura adicional)

source: ## Summary
es: ## Resumen

source: Reproducible research is great, but spending time on it will reduce the time you have available for activities by which researchers are traditionally measured, such as writing papers. But what if you could get credit for your reproducibility efforts as well?
es: La investigación reproducible es fantástica, pero dedicar tiempo a ella reducirá el tiempo disponible para las actividades por las que tradicionalmente se miden los investigadores, como la redacción de artículos. Pero, ¿y si también pudieras obtener crédito por tus esfuerzos de reproducibilidad?

source: ## How this will help you/ why this is useful
es: ## Cómo te ayudará esto/ por qué esto es útil

source: Academic research is a reputation economy, and citations are the currency. Most research institutions' promotion and hiring criteria depend to a greater or lesser extent on your publishing record: how many articles you have published, how "important" the journals were, and how many times each article has been cited.
es: La investigación universitaria es una economía y las citas son las divisas. La mayoría de las instituciones de investigación ascienden y contratan dependiendo en mayor o menor medida de la lista de publicaciones: cuántos artículos has publicado, cómo de "importantes" eran los revistas, y cuántas veces se ha citado cada artículo.

source: This is a well established practice, and while it has its problems at least all stakeholders understand what's involved. One of the consequences of this system is that labour which *doesn't* result in published articles tends to be ignored, discouraging researchers from making their data more open or specialising in software development.
es: Se trata de una práctica bien establecida y, aunque tiene sus problemas, al menos todas las partes interesadas entienden lo que implica. Una de las consecuencias de este sistema es que el trabajo que *no* da lugar a artículos publicados tiende a ser ignorado, lo que desanima a los investigadores a hacer sus datos más abiertos o a especializarse en el desarrollo de software.

source: Establishing good citation practice for non-article content is a step towards recognising this valuable work and encouraging more people to take it up. If you can demonstrate the impact of your reproducible research work in addition to more traditional research outputs, you can justify spending more time on doing things right.
es: El establecimiento de buenas prácticas de referencia para los contenidos que no son artículos es un paso hacia el reconocimiento de este valioso trabajo y para animar a más personas a realizarlo. Si puedes demostrar el impacto de tu trabajo de investigación reproducible, además de los resultados de investigación más tradicionales, podrás justificar el dedicar más tiempo a hacer las cosas bien.

source: ## Making it easy to cite your stuff
es: ## Facilitando la citabilidad de tu trabajo

source: There are many reasons why authors don't cite the data and software that they use, but one of the biggest ones is that it's not clear how. You can go a long way to reducing this barrier by following a few steps to make it as easy as possible.
es: Hay muchas razones por las que los autores no citan los datos y el software que utilizan, pero una de las más importantes es que no está claro cómo hacerlo. Puedes contribuir en gran medida a reducir esta barrera siguiendo algunos pasos para que sea lo más fácil posible.

source: ### Open research
es: ### Investigación abierta

source: The first step is to ensure that you have something worth citing. Practising open research isn't essential to get credit for your data or software, but it makes it much easier for others to build on your work in a way that acknowledges your contribution. There is a growing body of evidence that shows open research tends to be cited more than non-open research of equivalent quality and significance.
es: El primer paso es asegurarse de que tienes algo que merece la pena citar. Practicar la investigación abierta no es esencial para obtener crédito por sus datos o software, pero facilita mucho que otros se basen en su trabajo de forma que se reconozca su contribución. Cada vez hay más pruebas que demuestran que la investigación abierta tiende a ser más citada que la investigación no abierta de calidad e importancia equivalentes.

source: * [Learn more about making your research open][open research]
es: * [Más información sobre cómo hacer que tu investigación sea abierta][investigación abierta]

source: ### Show people how to do it
es: ### Muéstrale a la gente cómo hacerlo

source: Showing an example reference in the most common referencing format in your discipline serves two purposes:
es: Mostrar un ejemplo de referencia en el formato de referencia más común en su disciplina sirve para dos propósitos:

source: 1. It demonstrates that software & data are actually things that can be cited;
es: 1. Demuestra que el software y los datos son realmente cosas que pueden citarse;

source: 2. It gives authors a reference that they can copy and paste directly into their document.
es: 2. Ofrece a los autores una referencia que pueden copiar y pegar directamente en su documento.

source: If you use GitHub, GitLab or similar, consider creating a `CITATION` file in each repository containing an example reference.
es: Si utilizas GitHub, GitLab o similar, considera la posibilidad de crear un archivo `CITATION` en cada repositorio que contenga un ejemplo de referencia.

source: ### Add machine-readable referencing information
es: ### Añadir información de referencia legible por máquina

source: You can go one better by allowing people to import information about your research objects into their preferred referencing database.
es: Puedes ir más allá y permitir que la gente importe información sobre tus objetos de investigación a su base de datos de referencia preferida.

source: If BibTeX is popular in your field, post a `.bib` file of *all* your outputs, not just your papers; if it's Endnote, make an Endnote export available.
es: Si BibTeX es popular en tu campo, publica un archivo `.bib` de *todos* tus resultados, no sólo de tus artículos; si es Endnote, haz una exportación de Endnote disponible.

source: If possible, provide several formats: you won't need to update these very often and it will pay off.
es: Si es posible, proporcione varios formatos: no necesitará actualizarlos muy a menudo y te saldrá a cuenta.

source: ### Publish in software & data journals
es: ### Publicar en revistas de software y datos

source: It's perfectly possible to cite a dataset or software package directly, and most major publishers now permit this in their style guides. However, it can sometimes help to have a more conventional paper to cite, and this is where software and data journals come in. These journals are similar to methods journals, in that they tend not to include significant results but instead focus on describing data and software in sufficient detail to allow reuse. Some examples include:
es: Es perfectamente posible citar un conjunto de datos o un paquete de software directamente, y la mayoría de las principales editoriales lo permiten ahora en sus guías de estilo. Sin embargo, a veces puede ser útil tener un documento más convencional que citar, y aquí es donde entran las revistas de software y datos. Estas revistas son similares a las de métodos, en el sentido de que tienden a no incluir resultados significativos, sino que se centran en describir los datos y el software con suficiente detalle como para permitir su reutilización. Algunos ejemplos son (por sus nombres en inglés):

source: - Making stuff citable
es: - Hacer que las cosas sean citables

source: - *Can this just link to other chapters mainly?*
es: - *¿Puede esto enlazar con otros capítulos principalmente?*

source: - Data
es: - Datos

source: - Deposit it
es: - Deposítalo

source: - Deposit it (github isn't good enough)
es: - Deposítalo (github no es suficiente)

source: - Citing stuff
es: - Citando cosas

source: - Importance of using true citations
es: - Importancia de utilizar las citas correctas

source: - Different ways of citing
es: - Diferentes formas de citar

source: - The data/software itself (preferred)
es: - Los datos/el software en sí mismo (preferido)

source: - A data/software paper from a dedicated data/software journal
es: - Un artículo sobre datos/software de una revista especializada en datos/software

source: - A key paper identified by the creator/developer
es: - Un documento fundamental identificado por el creador/desarrollador

source: - A software manual
es: - Un manual de software

source: - What does/doesn't need to be cited
es: - Lo que hay que citar y lo que no hay que citar

source: - Overflow space for citations
es: - Espacio de sobra para las citas

source: ### For authors
es: ### Para los autores

source: - Pick out key datasets and software your conclusions rely on
es: - Elige conjuntos de datos clave y software para que tus conclusiones puedan puedan basarse en ellos

source: - Cite data and software just like you would cite a paper
es: - Cita los datos y el software de la misma manera que citarías un artículo

source: - Publish your own data/software and cite that too!
es: - Publica tus propios datos/software y cítalos también.

source: ### For data creators
es: ### Para los creadores de datos

source: - Deposit your data in a stable repository
es: - Deposita tus datos en un repositorio estable

source: - Get a persistent identifier (DOI) for your data
es: - Obten un identificador persistente (DOI) para sus datos

source: - Include an example citation in your dataset's README file
es: - Incluye un ejemplo de cita en el archivo README de tu conjunto de datos

source: ### For software developers
es: ### Para desarrolladores de software

source: - Deposit key version snapshots of your software in a stable repository
es: - Deposita versiones clave de tu software en un repositorio estable

source: - Get a distinct persistent identifier for each key version
es: - Obtener un identificador persistente distinto para cada versión clave

source: - Include an example citation in your software manual
es: - Incluye un ejemplo de cita en tu manual de software

source: ## Further reading
es: ## Lecturas complementarias

source: - [FAIR data principles](https://www.force11.org/group/fairgroup/fairprinciples)
es: - [Principios FAIR para datos (en inglés)](https://www.force11.org/group/fairgroup/fairprinciples)

source: - [FORCE11 Software Citation principles](https://www.force11.org/software-citation-principles)
es: - [Principios FORCE11 para referencia de software (en inglés)](https://www.force11.org/software-citation-principles)
