Repository: the-turing-way/the-turing-way
Catalog: book/content/po/figures.*.po
Languages: es

source: ### This is a list of figures in the book
es: ### Esta es una lista de figuras en el libro

source: **To be kept in alphabetical order**
es: **Mantener en orden alfabético**

source: | Filename | Chapter | Description |
es: | Nombre del archivo | Capítulo | Descripción |

source: | binder_comic | Reproducible environments | Cartoon showing using binder to share research |
es: | binder_comic | Entornos reproducibles | Caricatura sobre el uso de binder para compartir resultados de una investigación |

source: | binder_home | Reproducible environments | Home screen of an example binder |
es: | binder_home | Entornos reproducibles | Pantalla de inicio de binder como ejemplo |

source: | binder_notebook | Reproducible environments | Interacting with an example binder via a notebook |
es: | binder_notebook | Entornos reproducibles | Interacción como ejemplo de binder a traavés de un notebook|

source: | binder_terminal | Reproducible environments | Interacting with an example binder via a terminal |
es: | binder_terminal | Entornos reproducibles | Interacción como ejemplo de bindr a través de una terminal |

source: | cd_example | Reproducible environments | Example of result of using cd in a Dockerfile |
es: | cd_example | Entornos reproducbles | Ejemplo del resultado de usar cd en un Dockerfile |

source: | change_stage_repo | Version control | Cartoon showing staging and committing changes |
es: | change_stage_repo | Control de versiones | Caricatura que muestra el montaje y la realización de cambios |

source: | container_example | Reproducible environments | Demo of a simple container in terminal |
es: | container_example | Entornos reproducibles | Demo de un contenedor en terminal |

source: | docker_official_image | Reproducible environments | The official ubuntu docker image with badge |
es: | docker_official_image | Entornos reproducibles | La imagen oficial de ubuntu docker con insignia |

source: | eyeball_test_1 | Testing | Results tested by seeing if they 'look right' |
es: | eyeball_test_1 | Prueba | Testeo de resultados viendo si "se ven bien" |

source: | eyeball_test_2 | Testing | Results tested by seeing if they 'look right' |
es: | eyeball_test_2 | Prueba | Testeo de resultados viendo si "se ven bien" |

source: | eyeball_test_3 | Testing | Results tested by seeing if they 'look right' |
es: | eyeball_test_3 | Prueba | Testeo de resultados viendo si "se ven bien" |

source: | eyeball_test_error | Testing | Bug detected by result 'looking wrong' |
es: | eyeball_test_error | Prueba | Error detectado viendo que el resultado "parece incorrecto" |

source: | flipped_taj_mahal | Version control | Upside down taj mahal to confuse people |
es: | flipped_taj_mahal | Control de versiones | Taj mahal al revés para confundir a la gente |

source: | master_branch | Version control | Illustrates commits on master branch |
es: | master_branch | Control de versiones | Ilustra los "commits" (cambios) en la rama master |

source: | mybinder_gen_link | Reproducible environments | What the page to generate binder links looks like |
es: | mybinder_gen_link | Entornos reproducibles | Cómo se ve la página para generar enlaces de carpetas

source: | one_branch | Version control | Illustrates version control master + one branch |
es: | one_branch | Control de versiones | Ilustra el control de versiones de la rama "master" + otra rama |

source: | open_access_citatations | Open research | Impact of openness on citation count |
es: | open_access_citatations | Investigación abierta | Impacto de la apertura/accesibilidad en el número de citas |

source: | open_umbrella | Open research | Terms under the umbrella of open scholarship |
es: | open_umbrella | Investigación abierta | Términos en el marco de academia de acceso abierto |

source: | regents_map | BinderHub workshop | Map to workshop location |
es: | regents_map | Taller BinderHub | Mapa de ubicación del taller |

source: | reproducibility_kirstie | | Depicts cow code and data relate to good practise |
es: | Reproducibilidad_kirstie | Representa el "cow code" y los datos que se relacionan con las buenas prácticas |

source: | sub_branch | Version control | Illustrates version control branch + sub branch |
es: | sub_branch | Control de versiones | Ilustra el control de versiones de una rama + una sub-rama |

source: | testing_motivation_1 | Testing | Example of consequence of not testing code |
es: | testing_motivation_1 | "Testing" (pruebas) | Ejemplo de las consecuencias de no probar el código. |

source: | testing_motivation_2 | Testing | Example of consequence of not testing code |
es: | testing_motivation_2 | "Testing" (pruebas) | Ejemplo de las consecuencias de no probar el código. |

source: | Travis_badge_fail | Continuous integration | A readme with a failing Travis badge |
es: | Travis_badge_fail | Integración continua | Un "readme" con una insignia de Travis que falla |

source: | Travis_badge_pass | Continuous integration | A readme with a passing Travis badge |
es: | Travis_badge_pass| Integración continua | Un readme con una insignia de Travis que pasa |

source: | Travis_build | Continuous integration | What the Travis dashboard looks like |
es: | Travis_build | Integración continua | Cómo se ve el panel de control de Travis |

source: | two_branches | Version control | Illustrates version control master + two branches |
es: | two_branches | Control de versiones | Ilustra el control de versiones de una rama "master" + dos ramas |

source: | virtual_machine | Reproducible environments | Example of a virtual ubuntu machine on windows |
es: | virtual_machine | Entornos reproducibles | Ejemplo de una máquina virtual de ubuntu en windows |

source: | VM_create_machine | Reproducible environments | How to create a virtual machine in virtualbox |
es: | VM_create_machine | Entornos reproducibles | Cómo crear una máquina virtual en virtualbox |

source: | VM_export_machine | Reproducible environments | How to export a virtual machine in virtualbox |
es: | VM_export_machine | Entornos reproducibles | Cómo exportar una máquina virtual en virtualbox |

source: | VM_start_machine | Reproducible environments | How to start a virtual machine in virtualbox |
es: | VM_start_machine | Entornos reproducibles | Cómo arrancar una máquina virtual en virtualbox |

source: | workdir_example | Reproducible environments | Example of using workdir in Dockerfiles |
es: | Workdir_example | Entornos reproducibles | Ejemplo de uso de "workdir" en "Dockerfiles" (archivos de Docker) |

source: | wtf_per_min.jpg | Version control | Good quality code = few wtf per min |
es: | wtf_per_min.jpg | Control de versiones | Código de buena calidad = pocos "wtf" por minuto |
