Repository: the-turing-way/the-turing-way
Catalog: book/content/po/glossary.*.po
Languages: es

source: # Glossary
es: # Glosario

source: A web-based service which allows users to upload and share fully-functioning versions of their projects in an environment they define.
es: Un servicio basado en la web que permite a los usuarios cargar y compartir versiones totalmente funcionales de sus proyectos en un entorno computacional que definan.

source: #### Computational environment
es: #### Entorno computacional

source: Features of a computer which can impact the behaviour of work done on it, such as its operating system, what software it has installed, and what versions of software packages are installed.
es: Características de una computadora que pueden afectar el comportamiento del cómputo realizado en ella, como su sistema operativo, qué software ha instalado, y qué versiones de los paquetes de software están instalados.

source: A commonly used package management system.
es: Un sistema de gestión de paquetes usado comúnmente en ciencia de datos.

source: Lightweight files that can encapsulate and entire computational environment including its operating system, customised settings, software and files.
es: Archivos livianos que pueden encapsular todo el entorno computacional, incluido el sistema operativo, configuraciones personalizadas, software y archivos.

source: A file used for creating Docker images
es: Un archivo usado para crear imágenes de Docker

source: #### Image
es: #### Imagen

source: Files used for generating containers.
es: Archivos utilizados para generar contenedores.

source: #### Package management system
es: #### Sistema de gestión de paquetes

source: A tool for installing, managing, and uninstalling software packages including specific versions.
es: Una herramienta para instalar, administrar y desinstalar paquetes de software que incluyen versiones específicas.

source: #### Virtual machine
es: #### Máquina virtual

source: A simulated computer that can encapsulate and entire computational environment including its operating system, customised settings, software and files.
es: Una computadora simulada que puede encapsular todo el entorno computacional, incluido su sistema operativo, configuraciones personalizadas, software y archivos.

source: A human readable/writable markup language which used by many projects for configuration files.
es: Un lenguaje de marcado legible/escribible por humanos que utilizan muchos proyectos para archivos de configuración.
