Repository: the-turing-way/the-turing-way
Catalog: book/content/po/introduction.*.po
Languages: es

source: # Welcome to the Turing Way
es: # Bienvenido al The Turing Way

source: _The Turing Way_ is a lightly opinionated guide to reproducible data science.
es: _The Turing Way_ es una guía ligeramente dogmática para la ciencia de datos reproducible.

source: Our goal is to provide all the information that researchers need at the start of their projects to ensure that they are easy to reproduce at the end.
es: Nuestro objetivo es proveer toda la información que el personal investigador necesita al comenzar sus proyectos para garantizar que sean facilmente reproducibles.

source: This also means making sure PhD students, postdocs, PIs, and funding teams know which parts of the "responsibility of reproducibility" they can affect, and what they should do to nudge data science to being more efficient, effective, and understandable.
es: Esto también significa asegurarse de que los estudiantes de doctorado, los post-doctorados, los investigadores principales y los equipos de financiación sepan qué partes de la "responsabilidad de reproducibilidad" poseen y qué deben hacer para impulsar que la ciencia de datos sea más eficiente, efectiva y comprensible.

source: The book is collaboratively written and open from the start.
es: El libro está escrito de forma colaborativa y abierta desde el principio.

source: If you would like to contribute please [get in touch](https://github.com/alan-turing-institute/the-turing-way#get-in-touch) or visit our [contributing guidelines](https://github.com/alan-turing-institute/the-turing-way/blob/master/CONTRIBUTING.md) to learn how to start.
es: Si deseas contribuir, por favor [contacta] (https://github.com/alan-turing-institute/the-turing-way#get-in-touch) o visita nuestras [pautas de contribución] (https://github.com/alan-turing-institute/the-turing-way/blob/master/CONTRIBUTING.md) para conocer cómo comenzar.

source: We value the participation of every member of our community and want to ensure that every contributor has an enjoyable and fulfilling experience.
es: Valoramos la participación de cada miembro de nuestra comunidad y queremos asegurarnos de que cada contribuyente tenga una experiencia agradable y satisfactoria.

source: Accordingly, everyone who participates in the _Turing Way_ project is expected to show respect and courtesy to other community members at all times.
es: En consecuencia, esperamos que todos los que participan en el proyecto _Turing Way_ muestren respeto y cortesía a otros miembros de la comunidad en todo momento.

source: All contributions must abide by our [code of conduct](https://github.com/alan-turing-institute/the-turing-way/blob/master/CODE_OF_CONDUCT.md).
es: Todas las contribuciones deben cumplir con nuestro [código de conducta] (https://github.com/alan-turing-institute/the-turing-way/blob/master/CODE_OF_CONDUCT.md).

source: ## A little more background
es: ## Algo más de contexto

source: Reproducible research is necessary to ensure that scientific work can be trusted.
es: La investigación reproducible es necesaria para garantizar que el producto del trabajo científico sea considerado fiable.

source: Funders and publishers are beginning to require that publications include access to the underlying data and the analysis code.
es: Las instituciones de financiamiento y los editores de revistas científicas están comenzando a exigir que las publicaciones incluyan acceso a los datos analizados y al código de análisis.

source: The goal is to ensure that all results can be independently verified and built upon in future work.
es: El objetivo es garantizar que todos los resultados puedan verificarse independientemente y aprovecharse en trabajos futuros.

source: This is sometimes easier said than done.
es: Esto a veces es más fácil decirlo que hacerlo.

source: Sharing these research outputs means understanding data management, library sciences, sofware development, and continuous integration techniques: skills that are not widely taught or expected of academic researchers and data scientists.
es: Compartir estos resultados de investigación significa conocer temas como la gestión de datos, las ciencias de la biblioteconomía, el desarrollo de software y las técnicas de integración continua: habilidades que no son ampliamente enseñadas o requeridas a los investigadores académicos y científicos de datos.

source: The Turing Way is a handbook to support students, their supervisors, funders, and journal editors in ensuring that reproducible data science is "too easy not to do".
es: The Turing Way es un manual para ayudar a los estudiantes, sus supervisores, patrocinadores y editores de revistas a garantizar que la ciencia de datos reproducible sea "demasiado fácil para no hacerla".

source: It will include training material on version control, analysis testing, open and transparent communication with future users, and build on Turing Institute case studies and workshops.
es: Incluirá material de capacitación sobre control de versiones, pruebas de análisis, comunicación abierta y transparente con futuros usuarios, y se basará en casos de estudio y talleres del The Alan Turing Institute.

source: This project is openly developed and any and all questions, comments and recommendations are welcome at our GitHub repository: [https://github.com/alan-turing-institute/the-turing-way](https://github.com/alan-turing-institute/the-turing-way).
es: Este proyecto se desarrolla abiertamente y todas y cada una de las preguntas, comentarios y recomendaciones son bienvenidos en nuestro repositorio de GitHub: [https://github.com/alan-turing-institute/the-turing-way](https://github.com/alan-turing-institute/the-turing-way).

source: ## The book itself
es: ## El libro

source: The book that you are reading is a [jupyter book](https://github.com/jupyter/jupyter-book/).
es: El libro que estás leyendo es un [libro jupyter] (https://github.com/jupyter/jupyter-book/).

source: Jupyter books render markdown documents and jupyter notebooks as static html web pages.
es: Los libros de Jupyter representan documentos Markdown y Jupyter Notebooks como páginas web html estáticas.

source: They are easy to read and navigate...but also easy to edit and extend!
es: Son fáciles de leer y navegar ... ¡pero también fáciles de editar y ampliar!

source: There are some great example books at [https://jupyterbook.org](https://jupyterbook.org).
es: Hay algunos excelentes ejemplos de libros de Jupyter en [https://jupyterbook.org](https://jupyterbook.org).

source: Check out our [contributing guidelines](https://github.com/alan-turing-institute/the-turing-way/blob/master/CONTRIBUTING.md) on how you can help us build the most useful book we can!
es: ¡Mira nuestras [pautas de contribución] (https://github.com/alan-turing-institute/the-turing-way/blob/master/CONTRIBUTING.md) sobre cómo puedes ayudarnos a construir el libro lo más útil posible!

source: ## The Turing Way Community
es: ## La comunidad del The Turing Way

source: _The Turing Way_ is built by an incredible team.....and you!
es: _The Turing Way_ está construido por un equipo increíble ... ¡y tú!

source: The lead investigator for this project is [Dr Kirstie Whitaker](https://whitakerlab.github.io/about).
es: La investigadora principal de este proyecto es [Dr Kirstie Whitaker] (https://whitakerlab.github.io/about).

source: She is a research fellow at the [Alan Turing Institute](http://turing.ac.uk) and senior research associate in the [Department of Psychiatry](https://www.psychiatry.cam.ac.uk) at the University of Cambridge.
es: Es investigadora en el [Alan Turing Institute] (http://turing.ac.uk) e investigadora asociada en el [Departamento de Psiquiatría] (https://www.psychiatry.cam.ac.uk) en La Universidad de Cambridge.

source: Our core contributors are, in alphabetical order:
es: Nuestros principales contribuyentes son, en orden alfabético:

source: You can see all of our incredible contributors in our [README](https://github.com/alan-turing-institute/the-turing-way#contributors) file, and screengrabbed below.
es: Puede ver a todos nuestros increíbles colaboradores en nuestro archivo [README] (https://github.com/alan-turing-institute/the-turing-way#contributors), y en las fotos a continuación.

source: ![Grid of pictures and names of project contributors](../figures/contributors-twopanel.png)
es: ! [Cuadrícula con imágenes y nombres de colaboradores del proyecto] (../figures/contributors-twopanel.png)

source: ## Citing _The Turing Way_
es: ## Citando a _The Turing Way_

source: You can reference _The Turing Way_ through the project's Zenodo archive using doi: [10.5281/zenodo.3233853](https://doi.org/10.5281/zenodo.3233853).
es: Puedes hacer referencia a _The Turing Way_ a través del archivo Zenodo del proyecto usando doi: [10.5281/zenodo.3233853] (https://doi.org/10.5281/zenodo.3233853).

source: The citation will look something like:
es: La cita se verá así:

source: Please visit the [DOI link](https://doi.org/10.5281/zenodo.3233853) though to get the most recent version - the one above is not automatically generated and therefore may be out of date.
es: Visita el [enlace DOI] (https://doi.org/10.5281/zenodo.3233853) para obtener la versión más reciente: la dirección anterior no se genera automáticamente y, por lo tanto, puede estar desactualizada.

source: DOIs allow us to archive the repository and they are really valuable to ensure that the work is tracked in academic publications.
es: Los DOI nos permiten archivar el repositorio y son realmente valiosos para garantizar que el trabajo se rastree en publicaciones académicas.

source: You can also share the human-readable URL to a page in the book, for example: [https://the-turing-way.netlify.com/reproducibility/03/definitions.html](https://the-turing-way.netlify.com/reproducibility/03/definitions.html), but be aware that the project is under development and therefore these links may change over time.
es: También puedes compartir esta URL legible para humanos en una página del libro, por ejemplo: [https://the-turing-way.netlify.com/reproducibility/03/definitions.html](https://the-turing-way.netlify.com/reproducibility/03/definitions.html), pero ten en cuenta que el proyecto está en desarrollo y, por lo tanto, estos enlaces pueden cambiar con el tiempo.

source: You might want to include a [web archive link](http://web.archive.org) such as: [https://web.archive.org/web/20191030093753/https://the-turing-way.netlify.com/reproducibility/03/definitions.html](https://web.archive.org/web/20191030093753/https://the-turing-way.netlify.com/reproducibility/03/definitions.html) to make sure that you don't end up with broken links everywhere!
es: Es posible que desees incluir un [enlace de archivo web] (http://web.archive.org) como: [https://web.archive.org/web/20191030093753/https://the-turing-way.netlify.com/reproducibility/03/definitions.html](https://web.archive.org/web/20191030093753/https://the-turing-way.netlify.com/reproducibility/03/definitions.html) para asegurarte de no terminar con enlaces rotos en todas partes.

source: We really appreciate any references that you make to _The Turing Way_ project in your and we hope it is useful.
es: Realmente apreciamos cualquier referencia que hagas al _The Turing Way_ en tu proyecto y esperamos que sea útil.

source: If you have any questions please [get in touch](https://github.com/alan-turing-institute/the-turing-way#get-in-touch).
es: Si tienes alguna pregunta, por favor [contáctanos] (https://github.com/alan-turing-institute/the-turing-way#get-in-touch).
