Repository: the-turing-way/the-turing-way
Catalog: book/content/po/reproducibility.*.po
Languages: es

source: # Why reproducibility is important for science
es: ¿Por qué la reproducibilidad es importante para la ciencia?

source: Major media outlets have [reported on](https://www.theguardian.com/science/2018/aug/27/attempt-to-replicate-major-social-scientific-findings-of-past-decade-fails) investigations showing that a significant percentage of scientific studies cannot be reproduced.
es: Grandes medios de comunicación [han reportado] (https://www.theguardian.com/science/2018/aug/27/attempt-to-replicate-major-social-scientific-findings-of-past-decade-fails) resultados de investigaciones que demuestran que un porcentaje significativo de estudios científicos no puede ser reproducidos.

source: This leads to other academics and society losing trust in scientific results (Baker, 2016).
es: En consecuencia tanto académicos como la sociedad pierden la confianza en los resultados científicos (Baker, 2016).

source: Working reproducibly means others can check your results - even early on in the research process.
es: Trabajar de manera reproducible significa que otros pueden verificar tus resultados, incluso al principio del proceso de investigación.

source: Thus, the full analysis and methodology is transparent.
es: Por lo tanto, tanto el proceso de análisis como la metodología son transparentes.

source: Scientific results and evidence are strengthened if they are reproduced and confirmed by several independent researchers.
es: Los resultados y la evidencia científica se fortalecen si son reproducidos y confirmados por varios investigadores de manera independiente.

source: With all parts used in an analysis being available and/or documented, valuable time is saved reproducing published results and other researchers can easily build on these resarch results and re-use data or code for their analyses.
es: Cuando todas las herramientas y procedimientos usados en un análisis están disponibles y bien documentados, se ahorra un tiempo valioso reproduciendo los resultados publicados y otros investigadores pueden aprovechar fácilmente estos resultados reutilizando datos y/o códigos para sus análisis.

source: In addition, so called "negative results" can be published easily, helping avoid other researchers wasting time repeating analyses that will not return the expected results (Dirnagl & Lauritzen, 2010).
es: Además, los llamados "resultados negativos" se pueden publicar fácilmente, lo que ayuda a evitar que otros investigadores pierdan el tiempo repitiendo análisis que no arrojarán los resultados esperados (Dirnagl y Lauritzen, 2010).

source: # Why you should care about reproducibility
es: ¿Por qué deberías preocuparte por la reproducibilidad?

source: Markowetz highlights five reasons to work reproducibly (Markowetz, 2015):
es: Markowetz destaca cinco razones para trabajar de forma reproducible (Markowetz, 2015):

source: - **Avoiding disaster**: By working reproducibly, you can trust your own research results and will not have to retract published results or keep publications back because you cannot reproduce your results.
es: - ** Evitar desastres **: al trabajar de forma reproducible, puedes confiar en los resultados de tu investigación. Reducirás la posibilidad de tener que retractarte en el caso de resultados publicados o de retener publicaciones porque no puedes reproducir tus resultados.

source: - **Writing papers easier**: Well documented analyses ensure that you have easy access to the latest results, your work can easily be written up, and collaborators can easily get on board as additional authors.
es: - ** Facilitar la redacción de artículos científicos **: un análisis bien documentados asegura que tengas fácil acceso a los últimos resultados lo que facilita la redacción de los artículos científicos y que los colaboradores puedan también participar fácilmente en el proceso.

source: Furthermore, you can be sure that you easily comply with the highest-level journal guidelines.
es: Además, puedes estar seguro de cumplir fácilmente con las pautas de las revistas científicas de más alto nivel.

source: - **Convincing reviewers**: Making code and data available to the reviewers means their review comments will be constructive as they are able to develop an in-depth understanding of your work and can even try changes to your analysis themselves and see the impact.
es: - ** Convencer a los revisores **: Poner el código y los datos a disposición de los revisores incrementa la posibilidad de que sus comentarios serán más constructivos, ya que pueden desarrollar una comprensión profunda de tu trabajo e incluso pueden implementar cambios directamente en tu análisis y ver el impacto.

source: - **Facilitating continuity of work**: Well documented work means your work can easily be picked up and continued - either by others in your laboratory, or yourself if you want to build on your own work after a longer period.
es: - ** Facilitar la continuidad del trabajo **: un trabajo bien documentado facilita que tu trabajo pueda ser fácilmente continuado, ya sea por otros en tu laboratorio o por ti mismo en el futuro.

source: - **Building your reputation**: Putting in effort to make your research reproducible shows that you are a careful researcher and makes your research results more robust.
es: - ** Construir tu reputación **: Hacer un esfuerzo para hacer que tu investigación sea reproducible demuestra que eres un investigador cuidadoso y que te preocupas porque los resultados de tu investigación sean más sólidos.

source: Papers whose underlying data is available get cited more often (Piwowar, Day & Fridsma, 2007; Piwowar & Vision, 2013).
es: Los artículos científicos cuyos datos están disponibles son citados con mayor frecuencia (Piwowar, Day & Fridsma, 2007; Piwowar & Vision, 2013).

source: All research outputs that are shared can be built upon more easily by others and in some cases, others following up on your work might lead to new collaborations.
es: Compartir tus resultados permite que tu investigación pueda servir de base para otros investigadores y, en algunos casos, puede conducir a nuevas colaboraciones.

source: Other benefits of working openly are covered in our [Open Research](../open_research/open_research) chapter.
es: Otros beneficios de trabajar de manera abierta son discutidos en nuestro capítulo [Investigación abierta] (../open_research/open_research).

source: # Definitions of reproducibility
es: Definiciones de reproducibilidad

source: The most common definition of reproducibility (and replication) was first noted by Claerbout and Karrenbach in 1992 and has been used in computational science literature since then.
es: La definición más común de reproducibilidad (y replicabilidad) es aquella presentada por Claerbout y Karrenbach en 1992 y se ha utilizado en la literatura de ciencias computacionales desde entonces.

source: Another popular definition has been introduced in 2013 by the Association for Computing Machinery (ACM), which swapped the meaning of the terms 'reproducible' and 'replicable' compared to Claerbout and Karrenbach.
es: La Asociación de Maquinaria Informática (ACM, por sus siglas en inglés "Association for Computing Machinery") introdujo en 2013 otra definición, que cambió el significado de los términos 'reproducible' y 'replicable' en comparación con Claerbout y Karrenbach.

source: The following table contrasts both definitions following Heroux et al. (2018).
es: En la siguiente tabla se comparan ambas definiciones [Heroux et al. (2018)]

source: | Term | Claerbout & Karrenbach | ACM |
es: | Concepto | Claerbout & Karrenbach | ACM |

source: | Reproducible | Authors provide all the necessary data and the computer codes to run the analysis again, re-creating the results.| (Different team, different experimental setup.) The measurement can be obtained with stated precision by a different team, a different measuring system, in a different location on multiple trials. For computational experiments, this means that an independent group can obtain the same result using artifacts which they develop completely independently. |
es: | Reproducible | Los autores proporcionan todos los datos necesarios y los códigos para ejecutar el análisis y recrear los resultados.| (Equipo diferente, configuración experimental diferente). La medición puede ser obtenida con precisión establecida por un equipo diferente, un sistema de medición diferente, en una ubicación diferente y en múltiples ensayos. Para experimentos computacionales, esto significa que un grupo independiente puede obtener el mismo resultado utilizando artefactos que desarrollan de forma completamente independiente. |

source: | Replicable | A study that arrives at the same scientific findings as another study, collecting new data (possibly with different methods) and completing new analyses. | (Different team, same experimental setup.) The measurement can be obtained with stated precision by a different team using the same measurement procedure, the same measuring system, under the same operating conditions, in the same or a different location on multiple trials. For computational experiments, this means that an independent group can obtain the same result using the author's own artifacts. |
es: | Replicable | Un estudio que obtiene los mismos hallazgos científicos que otro estudio recolectando datos nuevos (posiblemente con métodos diferentes) y completando nuevos análisis. | (Equipo diferente, misma configuración experimental.) La medición puede ser obtenida con precisión establecida por un equipo diferente usando el mismo procedimiento de medición, el mismo sistema de medición, bajo las mismas condiciones de operación, en la misma ubicación o en una ubicación diferente y en múltiples ensayos. Para experimentos computacionales, esto significa que un grupo independiente puede obtener el mismo resultado utilizando los artefactos propios del autor. |

source: Barba (2018) conducted a detailed literature review on the usage of reproducible/replicable covering several disciplines.
es: Barba (2018) realizó una revisión detallada de la literatura sobre el uso de reproducible/replicable cubriendo varias disciplinas.

source: Most papers and disciplines use the terminology as defined by Claerbout and Karrenbach, whereas mircobiology, immunology and computer science tend to follow the ACM use of reproducibility and replication.
es: La mayoría de los artículos y disciplinas científicas utilizan la terminología definida por Claerbout y Karrenbach, mientras que la microbiología, la inmunología y las ciencias computacionales tienden a seguir la definición de reproducibilidad y replicabilidad de la ACM.

source: In political science and economics literature, both terms are used interchangeably.
es: En la literatura de ciencias políticas y economía, ambos términos se usan indistintamente.

source: In addition to these high level definitions of reporducibility, some authors provide more detailed disctinctions.
es: Además de estas definiciones de reproducibilidad, algunos autores proporcionan definiciones y comparaciones más detalladas.

source: Victoria Stodden [(2014)](http://edge.org/response-detail/25340), a prominent scholar on this topic, has for example identified the following further distinctions:
es: Victoria Stodden [(2014)] (http://edge.org/response-detail/25340), una destacada académica en este tema, ha identificado, por ejemplo, las siguientes distinciones adicionales:

source: - _Computational reproducibility_: When detailed information is provided about code, software, hardware and implementation details.
es: - _Reproducibilidad computacional_: cuando se proporciona información detallada sobre el código, el software, el hardware y los detalles de implementación.

source: - _Empirical reproducibility_: When detailed information is provided about non-computational empirical scientific experiments and observations. In practice this is enabled by making data freely available, as well as details of how the data was collected.
es: - _Reproducibilidad empírica_: cuando se proporciona información detallada sobre experimentos y observaciones científicas empíricas no computacionales. En la práctica, esto se habilita haciendo que los datos estén disponibles gratuitamente, así como también los detalles de cómo se recopilaron los datos.

source: - _Statistical reproducibility_: When detailed information is provided, for example, about the choice of statistical tests, model parameters, and threshold values. This mostly relates to pre-registration of study design to prevent p-value hacking and other manipulations.
es: - _Reproducibilidad estadística_: cuando se proporciona información detallada, por ejemplo, sobre la elección de pruebas estadísticas, parámetros del modelos y valores de umbral/threshold. Esto se relaciona principalmente con el registro previo del diseño del estudio para evitar p-hacking y otras manipulaciones.

source: ## The Turing Way definition of reproducibility
es: ## La definición de reproducibilidad del Turing Way

source: The Turing Way project will define reproducible research as both data and code being available to fully rerun the analysis.
es: El Turing Way definirá la investigación reproducible como aquella donde datos y código están disponibles para volver a ejecutar completamente el análisis.

source: | ![Kirstie's definition of reproducible research](../../figures/reproducibility/ReproducibleMatrix.jpg) |
es: | ![La definición de Kirstie de investigación reproducible](../../figures/reproducibility/ReproducibleMatrix.jpg) |

source: | How the Turing Way defines reproducible research |
es: | ¿Cómo define el Turing Way la investigación reproducible? |

source: However, we recognize that some research will use sensitive data that cannot be shared and this handbook will provide guides on how your research can be reproducible without all parts necessarily being open.
es: Sin embargo, reconocemos que algunas investigaciones utilizarán datos confidenciales que no se pueden compartir y este manual proporcionará guías sobre cómo tu investigación puede ser reproducible sin que todas las partes estén necesariamente abiertas y disponibles.

source: The handbook will cover:
es: Esta guia cubrirá:

source: * Open research
es: * Investigación abierta

source: * Version control (using git)
es: * Control de versiones (usando git)

source: * Collaborating on GitHub/GitLab
es: * Colaborando en GitHub / GitLab

source: * Credit for reproducible research
es: * Crédito por investigación reproducible

source: * Research data management
es: * Gestión de datos de investigación

source: * Reproducible environments
es: * Ambientes reproducibles

source: * Testing
es: * Pruebas

source: * Reviewing
es: * Revisando

source: * Continuous integration
es: * Integración continua

source: * Reproducible research with make
es: * Investigación reproducible con "make"

source: * Risk assessments
es: * Evaluaciones de riesgo

source: * Various case studies
es: * Varios casos de estudio

source: * Checklists to get you started on reproducible practices
es: * Listas de verificación para comenzar con prácticas reproducibles

source: # Resources for reproducibility chapter
es: # Recursos para el capítulo de reproducibilidad

source: ## Checklist / Exercise
es: ## Lista de verificación / ejercicio

source: - [ ] Define reproducibility for yourself.
es: - [ ] Define la reproducibilidad usted mismo.

source: ## What to learn next?
es: ## ¿Qué aprender a continuación?

source: Open Research would be a good chapter to read next.
es: Investigación abierta sería un buen capítulo para leer a continuación.

source: If you want to start learning hands-on practices, we recommend reading the Version Control chapter next.
es: Si deseas comenzar a aprender principios prácticos, te recomendamos leer el capítulo Control de versiones a continuación.

source: ## Bibliography
es: ## Bibliografía

source: ## Additional material
es: ## Material adicional

source: ### Recommended reading
es: ### Lectura recomendada

source: ### Other useful links
es: ### Otros enlaces útiles

source: # What is reproducible science?
es: # ¿Qué es ciencia reproducible?

source: ## Prerequisites / recommended skill level
es: ## Pre-requisitos / nivel de conocimiento recomendado

source: No previous knowledge needed.
es: Sin necesidad de conocimiento previo.

source: ## Table of contents
es: ## Tabla de contenidos

source: 1. [Why reproducibility is important for science](01/importantforscience)
es: 1. [Por qué la reproducibilidad es importante para la ciencia] (01 / importantforscience)

source: 2. [Why you should care about reproducibility](02/whycare)
es: 2. [Por qué deberías preocuparte por la reproducibilidad] (02/whycare)

source: 3. [Definitions of reproducibility](03/definitions)
es: 3. [Definiciones de reproducibilidad] (03/definitions)

source: 4. [Resources for reproducibility chapter](04/resources)
es: 4. [Capítulo sobre recursos para la reproducibilidad](04/resources)

source: ## Summary
es: ## Resumen

source: There are several definitions of reproducibility in use, and we discuss these in more detail in the [definitions](03/definitions) section of this chapter.
es: Hay varias definiciones de reproducibilidad en uso, y las discutimos con más detalle en la sección [definiciones](03/definitions) de este capítulo.

source: The Turing Way defines reproducibility as data and code being available to fully rerun the analysis.
es: The Turing Way define la reproducibilidad como los datos y el código disponible para volver a ejecutar un análisis por completo.

source: This chapter will lay out why reproducibility is important for science and scientists, provide an overview of the most common definitions, and define reproducibility in the context of this handbook.
es: Este capítulo expondrá por qué la reproducibilidad es importante para la ciencia y los científicos, proporcionará una descripción general de las definiciones más comunes y definirá la reproducibilidad en el contexto de esta guía.

source: ## How this will help you / why this is useful
es: ## Cómo te ayudará esto / por qué es útil

source: This chapter sets out the definition of reproducibility that the Turing Way project team used when writing this handbook.
es: Este capítulo establece la definición de reproducibilidad que el equipo del proyecto Turing Way utilizó al escribir este manual.

source: It will be useful to avoid misunderstandings when reading the rest of the handbook.
es: Será útil para evitar malentendidos al leer el resto del manual.
